{
  "data": {
    "type": "provider-docs",
    "id": "3254743",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"ACM PCA (Certificate Manager Private Certificate Authority)\"\nlayout: \"aws\"\npage_title: \"AWS: aws_acmpca_certificate_authority\"\ndescription: |-\n  Provides a resource to manage AWS Certificate Manager Private Certificate Authorities\n---\n\n# Resource: aws_acmpca_certificate_authority\n\nProvides a resource to manage AWS Certificate Manager Private Certificate Authorities (ACM PCA Certificate Authorities).\n\n~> **NOTE:** Creating this resource will leave the certificate authority in a `PENDING_CERTIFICATE` status, which means it cannot yet issue certificates. To complete this setup, you must fully sign the certificate authority CSR available in the `certificate_signing_request` attribute. The [`aws_acmpca_certificate_authority_certificate`](/docs/providers/aws/r/acmpca_certificate_authority_certificate.html) resource can be used for this purpose.\n\n## Example Usage\n\n### Basic\n\n```terraform\nresource \"aws_acmpca_certificate_authority\" \"example\" {\n  certificate_authority_configuration {\n    key_algorithm     = \"RSA_4096\"\n    signing_algorithm = \"SHA512WITHRSA\"\n\n    subject {\n      common_name = \"example.com\"\n    }\n  }\n\n  permanent_deletion_time_in_days = 7\n}\n```\n\n### Short-lived certificate\n\n```terraform\nresource \"aws_acmpca_certificate_authority\" \"example\" {\n  usage_mode = \"SHORT_LIVED_CERTIFICATE\"\n  certificate_authority_configuration {\n    key_algorithm     = \"RSA_4096\"\n    signing_algorithm = \"SHA512WITHRSA\"\n\n    subject {\n      common_name = \"example.com\"\n    }\n  }\n}\n```\n\n### Enable Certificate Revocation List\n\n```terraform\nresource \"aws_s3_bucket\" \"example\" {\n  bucket        = \"example\"\n  force_destroy = true\n}\n\ndata \"aws_iam_policy_document\" \"acmpca_bucket_access\" {\n  statement {\n    actions = [\n      \"s3:GetBucketAcl\",\n      \"s3:GetBucketLocation\",\n      \"s3:PutObject\",\n      \"s3:PutObjectAcl\",\n    ]\n\n    resources = [\n      aws_s3_bucket.example.arn,\n      \"${aws_s3_bucket.example.arn}/*\",\n    ]\n\n    principals {\n      identifiers = [\"acm-pca.amazonaws.com\"]\n      type        = \"Service\"\n    }\n  }\n}\n\nresource \"aws_s3_bucket_policy\" \"example\" {\n  bucket = aws_s3_bucket.example.id\n  policy = data.aws_iam_policy_document.acmpca_bucket_access.json\n}\n\nresource \"aws_acmpca_certificate_authority\" \"example\" {\n  certificate_authority_configuration {\n    key_algorithm     = \"RSA_4096\"\n    signing_algorithm = \"SHA512WITHRSA\"\n\n    subject {\n      common_name = \"example.com\"\n    }\n  }\n\n  revocation_configuration {\n    crl_configuration {\n      custom_cname       = \"crl.example.com\"\n      enabled            = true\n      expiration_in_days = 7\n      s3_bucket_name     = aws_s3_bucket.example.id\n      s3_object_acl      = \"BUCKET_OWNER_FULL_CONTROL\"\n    }\n  }\n\n  depends_on = [aws_s3_bucket_policy.example]\n}\n```\n\n## Argument Reference\n\nThis resource supports the following arguments:\n\n* `certificate_authority_configuration` - (Required) Nested argument containing algorithms and certificate subject information. Defined below.\n* `enabled` - (Optional) Whether the certificate authority is enabled or disabled. Defaults to `true`. Can only be disabled if the CA is in an `ACTIVE` state.\n* `revocation_configuration` - (Optional) Nested argument containing revocation configuration. Defined below.\n* `usage_mode` - (Optional) Specifies whether the CA issues general-purpose certificates that typically require a revocation mechanism, or short-lived certificates that may optionally omit revocation because they expire quickly. Short-lived certificate validity is limited to seven days. Defaults to `GENERAL_PURPOSE`. Valid values: `GENERAL_PURPOSE` and `SHORT_LIVED_CERTIFICATE`.\n* `tags` - (Optional) Key-value map of user-defined tags that are attached to the certificate authority. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n* `type` - (Optional) Type of the certificate authority. Defaults to `SUBORDINATE`. Valid values: `ROOT` and `SUBORDINATE`.\n* `key_storage_security_standard` - (Optional) Cryptographic key management compliance standard used for handling CA keys. Defaults to `FIPS_140_2_LEVEL_3_OR_HIGHER`. Valid values: `FIPS_140_2_LEVEL_3_OR_HIGHER` and `FIPS_140_2_LEVEL_2_OR_HIGHER`. Supported standard for each region can be found in the [Storage and security compliance of AWS Private CA private keys Documentation](https://docs.aws.amazon.com/privateca/latest/userguide/data-protection.html#private-keys).\n* `permanent_deletion_time_in_days` - (Optional) Number of days to make a CA restorable after it has been deleted, must be between 7 to 30 days, with default to 30 days.\n\n### certificate_authority_configuration\n\n* `key_algorithm` - (Required) Type of the public key algorithm and size, in bits, of the key pair that your key pair creates when it issues a certificate. Valid values can be found in the [ACM PCA Documentation](https://docs.aws.amazon.com/privateca/latest/APIReference/API_CertificateAuthorityConfiguration.html).\n* `signing_algorithm` - (Required) Name of the algorithm your private CA uses to sign certificate requests. Valid values can be found in the [ACM PCA Documentation](https://docs.aws.amazon.com/privateca/latest/APIReference/API_CertificateAuthorityConfiguration.html).\n* `subject` - (Required) Nested argument that contains X.500 distinguished name information. At least one nested attribute must be specified.\n\n#### subject\n\nContains information about the certificate subject. Identifies the entity that owns or controls the public key in the certificate. The entity can be a user, computer, device, or service.\n\n* `common_name` - (Optional) Fully qualified domain name (FQDN) associated with the certificate subject. Must be less than or equal to 64 characters in length.\n* `country` - (Optional) Two digit code that specifies the country in which the certificate subject located. Must be less than or equal to 2 characters in length.\n* `distinguished_name_qualifier` - (Optional) Disambiguating information for the certificate subject. Must be less than or equal to 64 characters in length.\n* `generation_qualifier` - (Optional) Typically a qualifier appended to the name of an individual. Examples include Jr. for junior, Sr. for senior, and III for third. Must be less than or equal to 3 characters in length.\n* `given_name` - (Optional) First name. Must be less than or equal to 16 characters in length.\n* `initials` - (Optional) Concatenation that typically contains the first letter of the `given_name`, the first letter of the middle name if one exists, and the first letter of the `surname`. Must be less than or equal to 5 characters in length.\n* `locality` - (Optional) Locality (such as a city or town) in which the certificate subject is located. Must be less than or equal to 128 characters in length.\n* `organization` - (Optional) Legal name of the organization with which the certificate subject is affiliated. Must be less than or equal to 64 characters in length.\n* `organizational_unit` - (Optional) Subdivision or unit of the organization (such as sales or finance) with which the certificate subject is affiliated. Must be less than or equal to 64 characters in length.\n* `pseudonym` - (Optional) Typically a shortened version of a longer `given_name`. For example, Jonathan is often shortened to John. Elizabeth is often shortened to Beth, Liz, or Eliza. Must be less than or equal to 128 characters in length.\n* `state` - (Optional) State in which the subject of the certificate is located. Must be less than or equal to 128 characters in length.\n* `surname` - (Optional) Family name. In the US and the UK for example, the surname of an individual is ordered last. In Asian cultures the surname is typically ordered first. Must be less than or equal to 40 characters in length.\n* `title` - (Optional) Title such as Mr. or Ms. which is pre-pended to the name to refer formally to the certificate subject. Must be less than or equal to 64 characters in length.\n\n### revocation_configuration\n\n* `crl_configuration` - (Optional) Nested argument containing configuration of the certificate revocation list (CRL), if any, maintained by the certificate authority. Defined below.\n* `ocsp_configuration` - (Optional) Nested argument containing configuration of\nthe custom OCSP responder endpoint. Defined below.\n\n#### crl_configuration\n\n* `custom_cname` - (Optional) Name inserted into the certificate CRL Distribution Points extension that enables the use of an alias for the CRL distribution point. Use this value if you don't want the name of your S3 bucket to be public. Must be less than or equal to 253 characters in length.\n* `enabled` - (Optional) Boolean value that specifies whether certificate revocation lists (CRLs) are enabled. Defaults to `false`.\n* `expiration_in_days` - (Optional, Required if `enabled` is `true`) Number of days until a certificate expires. Must be between 1 and 5000.\n* `s3_bucket_name` - (Optional, Required if `enabled` is `true`) Name of the S3 bucket that contains the CRL. If you do not provide a value for the `custom_cname` argument, the name of your S3 bucket is placed into the CRL Distribution Points extension of the issued certificate. You must specify a bucket policy that allows ACM PCA to write the CRL to your bucket. Must be between 3 and 255 characters in length.\n* `s3_object_acl` - (Optional) Determines whether the CRL will be publicly readable or privately held in the CRL Amazon S3 bucket. Defaults to `PUBLIC_READ`.\n\n#### ocsp_configuration\n\n* `enabled` - (Required) Boolean value that specifies whether a custom OCSP responder is enabled.\n* `ocsp_custom_cname` - (Optional) CNAME specifying a customized OCSP domain. Note: The value of the CNAME must not include a protocol prefix such as \"http://\" or \"https://\".\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `id` - ARN of the certificate authority.\n* `arn` - ARN of the certificate authority.\n* `certificate` - Base64-encoded certificate authority (CA) certificate. Only available after the certificate authority certificate has been imported.\n* `certificate_chain` - Base64-encoded certificate chain that includes any intermediate certificates and chains up to root on-premises certificate that you used to sign your private CA certificate. The chain does not include your private CA certificate. Only available after the certificate authority certificate has been imported.\n* `certificate_signing_request` - The base64 PEM-encoded certificate signing request (CSR) for your private CA certificate.\n* `not_after` - Date and time after which the certificate authority is not valid. Only available after the certificate authority certificate has been imported.\n* `not_before` - Date and time before which the certificate authority is not valid. Only available after the certificate authority certificate has been imported.\n* `serial` - Serial number of the certificate authority. Only available after the certificate authority certificate has been imported.\n* `tags_all` - Map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block).\n\n## Timeouts\n\n[Configuration options](https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts):\n\n* `create` - (Default `1m`)\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import `aws_acmpca_certificate_authority` using the certificate authority ARN. For example:\n\n```terraform\nimport {\n  to = aws_acmpca_certificate_authority.example\n  id = \"arn:aws:acm-pca:us-east-1:123456789012:certificate-authority/12345678-1234-1234-1234-123456789012\"\n}\n```\n\nUsing `terraform import`, import `aws_acmpca_certificate_authority` using the certificate authority ARN. For example:\n\n```console\n% terraform import aws_acmpca_certificate_authority.example arn:aws:acm-pca:us-east-1:123456789012:certificate-authority/12345678-1234-1234-1234-123456789012\n```\n",
      "language": "hcl",
      "path": "website/docs/r/acmpca_certificate_authority.html.markdown",
      "slug": "acmpca_certificate_authority",
      "subcategory": "ACM PCA (Certificate Manager Private Certificate Authority)",
      "title": "acmpca_certificate_authority",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3254743"
    }
  }
}