{
  "data": {
    "type": "provider-docs",
    "id": "3254282",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"CloudFront\"\nlayout: \"aws\"\npage_title: \"AWS: aws_cloudfront_response_headers_policy\"\ndescription: |-\n  Use this data source to retrieve information about a CloudFront response headers policy.\n---\n\n# Data Source: aws_cloudfront_response_headers_policy\n\nUse this data source to retrieve information about a CloudFront cache policy.\n\n## Example Usage\n\n### Basic Usage\n\n```terraform\ndata \"aws_cloudfront_response_headers_policy\" \"example\" {\n  name = \"example-policy\"\n}\n```\n\n### AWS-Managed Policies\n\nAWS managed response header policy names are prefixed with `Managed-`:\n\n```terraform\ndata \"aws_cloudfront_response_headers_policy\" \"example\" {\n  name = \"Managed-SimpleCORS\"\n}\n```\n\n## Argument Reference\n\nThis data source supports the following arguments:\n\n* `name` - (Optional) Unique name to identify the response headers policy.\n* `id` - (Optional) Identifier for the response headers policy.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `comment` - Comment to describe the response headers policy. The comment cannot be longer than 128 characters.\n* `etag` - Current version of the response headers policy.\n* `cors_config` - Configuration for a set of HTTP response headers that are used for Cross-Origin Resource Sharing (CORS). See [Cors Config](#cors-config) for more information.\n* `custom_headers_config` - Object that contains an attribute `items` that contains a list of Custom Headers. See [Custom Header](#custom-header) for more information.\n* `remove_headers_config` - Object that contains an attribute `items` that contains a list of Remove Headers. See [Remove Header](#remove-header) for more information.\n* `security_headers_config` - A configuration for a set of security-related HTTP response headers. See [Security Headers Config](#security-headers-config) for more information.\n* `server_timing_headers_config` - (Optional) Configuration for enabling the Server-Timing header in HTTP responses sent from CloudFront. See [Server Timing Headers Config](#server-timing-headers-config) for more information.\n\n### Cors Config\n\n* `access_control_allow_credentials` - A Boolean value that CloudFront uses as the value for the Access-Control-Allow-Credentials HTTP response header.\n* `access_control_allow_headers` - Object that contains an attribute `items` that contains a list of HTTP header names that CloudFront includes as values for the Access-Control-Allow-Headers HTTP response header.\n* `access_control_allow_methods` - Object that contains an attribute `items` that contains a list of HTTP methods that CloudFront includes as values for the Access-Control-Allow-Methods HTTP response header. Valid values: `GET` | `POST` | `OPTIONS` | `PUT` | `DELETE` | `HEAD` | `ALL`\n* `access_control_allow_origins` - Object that contains an attribute `items` that contains a list of origins that CloudFront can use as the value for the Access-Control-Allow-Origin HTTP response header.\n* `access_control_expose_headers` - Object that contains an attribute `items` that contains a list of HTTP headers that CloudFront includes as values for the Access-Control-Expose-Headers HTTP response header.\n* `access_control_max_age_sec` - A number that CloudFront uses as the value for the Access-Control-Max-Age HTTP response header.\n\n### Custom Header\n\n* `header` - HTTP response header name.\n* `override` - Whether CloudFront overrides a response header with the same name received from the origin with the header specifies here.\n* `value` - Value for the HTTP response header.\n\n### Remove Header\n\n* `header` - The HTTP header name.\n\n### Security Headers Config\n\n* `content_security_policy` - The policy directives and their values that CloudFront includes as values for the Content-Security-Policy HTTP response header. See [Content Security Policy](#content-security-policy) for more information.\n* `content_type_options` - A setting that determines whether CloudFront includes the X-Content-Type-Options HTTP response header with its value set to nosniff. See [Content Type Options](#content-type-options) for more information.\n* `frame_options` - Setting that determines whether CloudFront includes the X-Frame-Options HTTP response header and the header’s value. See [Frame Options](#frame-options) for more information.\n* `referrer_policy` - Setting that determines whether CloudFront includes the Referrer-Policy HTTP response header and the header’s value. See [Referrer Policy](#referrer-policy) for more information.\n* `strict_transport_security` - Settings that determine whether CloudFront includes the Strict-Transport-Security HTTP response header and the header’s value. See [Strict Transport Security](#strict-transport-security) for more information.\n* `xss_protection` - Settings that determine whether CloudFront includes the X-XSS-Protection HTTP response header and the header’s value. See [XSS Protection](#xss-protection) for more information.\n\n### Content Security Policy\n\n* `content_security_policy` - The policy directives and their values that CloudFront includes as values for the Content-Security-Policy HTTP response header.\n* `override` - Whether CloudFront overrides the Content-Security-Policy HTTP response header received from the origin with the one specified in this response headers policy.\n\n### Content Type Options\n\n* `override` - Whether CloudFront overrides the X-Content-Type-Options HTTP response header received from the origin with the one specified in this response headers policy.\n\n### Frame Options\n\n* `frame_option` - Value of the X-Frame-Options HTTP response header. Valid values: `DENY` | `SAMEORIGIN`\n* `override` - Whether CloudFront overrides the X-Frame-Options HTTP response header received from the origin with the one specified in this response headers policy.\n\n### Referrer Policy\n\n* `referrer_policy` - Value of the Referrer-Policy HTTP response header. Valid Values: `no-referrer` | `no-referrer-when-downgrade` | `origin` | `origin-when-cross-origin` | `same-origin` | `strict-origin` | `strict-origin-when-cross-origin` | `unsafe-url`\n* `override` - Whether CloudFront overrides the Referrer-Policy HTTP response header received from the origin with the one specified in this response headers policy.\n\n### Strict Transport Security\n\n* `access_control_max_age_sec` - A number that CloudFront uses as the value for the max-age directive in the Strict-Transport-Security HTTP response header.\n* `include_subdomains` - Whether CloudFront includes the includeSubDomains directive in the Strict-Transport-Security HTTP response header.\n* `override` - Whether CloudFront overrides the Strict-Transport-Security HTTP response header received from the origin with the one specified in this response headers policy.\n* `preload` - Whether CloudFront includes the preload directive in the Strict-Transport-Security HTTP response header.\n\n### XSS Protection\n\n* `mode_block` - Whether CloudFront includes the mode=block directive in the X-XSS-Protection header.\n* `override` - Whether CloudFront overrides the X-XSS-Protection HTTP response header received from the origin with the one specified in this response headers policy.\n* `protection` - Boolean value that determines the value of the X-XSS-Protection HTTP response header. When this setting is true, the value of the X-XSS-Protection header is 1. When this setting is false, the value of the X-XSS-Protection header is 0.\n* `report_uri` - Whether CloudFront sets a reporting URI in the X-XSS-Protection header.\n\n### Server Timing Headers Config\n\n* `enabled` - Whether CloudFront adds the `Server-Timing` header to HTTP responses that it sends in response to requests that match a cache behavior that's associated with this response headers policy.\n* `sampling_rate` - Number 0–100 (inclusive) that specifies the percentage of responses that you want CloudFront to add the Server-Timing header to.\n",
      "language": "hcl",
      "path": "website/docs/d/cloudfront_response_headers_policy.html.markdown",
      "slug": "cloudfront_response_headers_policy",
      "subcategory": "CloudFront",
      "title": "cloudfront_response_headers_policy",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3254282"
    }
  }
}