{
  "data": {
    "type": "provider-docs",
    "id": "3254601",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"QuickSight\"\nlayout: \"aws\"\npage_title: \"AWS: aws_quicksight_theme\"\ndescription: |-\n  Use this data source to fetch information about a QuickSight Theme.\n---\n\n# Data Source: aws_quicksight_theme\n\nTerraform data source for managing an AWS QuickSight Theme.\n\n## Example Usage\n\n### Basic Usage\n\n```terraform\ndata \"aws_quicksight_theme\" \"example\" {\n  theme_id = \"example\"\n}\n```\n\n## Argument Reference\n\nThe following arguments are required:\n\n* `theme_id` - Identifier of the theme.\n\nThe following arguments are optional:\n\n* `aws_account_id` - AWS account ID.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `arn` - ARN of the theme.\n* `base_theme_id` - The ID of the theme that a custom theme will inherit from. All themes inherit from one of the starting themes defined by Amazon QuickSight.\n* `configuration` - The theme configuration, which contains the theme display properties. See [configuration](#configuration).\n* `created_time` - The time that the theme was created.\n* `id` - A comma-delimited string joining AWS account ID and theme ID.\n* `last_updated_time` - The time that the theme was last updated.\n* `name` - Display name of the theme.\n* `permissions` - A set of resource permissions on the theme. See [permissions](#permissions).\n* `status` - The theme creation status.\n* `tags` - A map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](/docs/providers/aws/index.html#default_tags-configuration-block).\n* `version_description` - A description of the current theme version being created/updated.\n* `version_number` - The version number of the theme version.\n\n### permissions\n\n* `actions` - List of IAM actions to grant or revoke permissions on.\n* `principal` - ARN of the principal. See the [ResourcePermission documentation](https://docs.aws.amazon.com/quicksight/latest/APIReference/API_ResourcePermission.html) for the applicable ARN values.\n\n### configuration\n\n* `data_color_palette` - Color properties that apply to chart data colors. See [data_color_palette](#data_color_palette).\n* `sheet` - Display options related to sheets. See [sheet](#sheet).\n* `typography` - Determines the typography options. See [typography](#typography).\n* `ui_color_palette` - Color properties that apply to the UI and to charts, excluding the colors that apply to data. See [ui_color_palette](#ui_color_palette).\n\n### data_color_palette\n\n* `colors` - List of hexadecimal codes for the colors. Minimum of 8 items and maximum of 20 items.\n* `empty_fill_color` - The hexadecimal code of a color that applies to charts where a lack of data is highlighted.\n* `min_max_gradient` - The minimum and maximum hexadecimal codes that describe a color gradient. List of exactly 2 items.\n\n### sheet\n\n* `tile` - The display options for tiles. See [tile](#tile).\n* `tile_layout` - The layout options for tiles. See [tile_layout](#tile_layout).\n\n### tile\n\n* `border` - The border around a tile. See [border](#border).\n\n### border\n\n* `show` - The option to enable display of borders for visuals.\n\n### tile_layout\n\n* `gutter` - The gutter settings that apply between tiles. See [gutter](#gutter).\n* `margin` - The margin settings that apply around the outside edge of sheets. See [margin](#margin).\n\n### gutter\n\n* `show` - This Boolean value controls whether to display a gutter space between sheet tiles.\n\n### margin\n\n* `show` - This Boolean value controls whether to display sheet margins.\n\n### typography\n\n* `font_families` - Determines the list of font families. Maximum number of 5 items. See [font_families](#font_families).\n\n### font_families\n\n* `font_family` - Font family name.\n\n### ui_color_palette\n\n* `accent` - Color (hexadecimal) that applies to selected states and buttons.\n* `accent_foreground` - Color (hexadecimal) that applies to any text or other elements that appear over the accent color.\n* `danger` - Color (hexadecimal) that applies to error messages.\n* `danger_foreground` - Color (hexadecimal) that applies to any text or other elements that appear over the error color.\n* `dimension` - Color (hexadecimal) that applies to the names of fields that are identified as dimensions.\n* `dimension_foreground` - Color (hexadecimal) that applies to any text or other elements that appear over the dimension color.\n* `measure` - Color (hexadecimal) that applies to the names of fields that are identified as measures.\n* `measure_foreground` - Color (hexadecimal) that applies to any text or other elements that appear over the measure color.\n* `primary_background` - Color (hexadecimal) that applies to visuals and other high emphasis UI.\n* `primary_foreground` - Color (hexadecimal) of text and other foreground elements that appear over the primary background regions, such as grid lines, borders, table banding, icons, and so on.\n* `secondary_background` - Color (hexadecimal) that applies to the sheet background and sheet controls.\n* `secondary_foreground` - Color (hexadecimal) that applies to any sheet title, sheet control text, or UI that appears over the secondary background.\n* `success` - Color (hexadecimal) that applies to success messages, for example the check mark for a successful download.\n* `success_foreground` - Color (hexadecimal) that applies to any text or other elements that appear over the success color.\n* `warning` - Color (hexadecimal) that applies to warning and informational messages.\n* `warning_foreground` - Color (hexadecimal) that applies to any text or other elements that appear over the warning color.\n",
      "language": "hcl",
      "path": "website/docs/d/quicksight_theme.html.markdown",
      "slug": "quicksight_theme",
      "subcategory": "QuickSight",
      "title": "quicksight_theme",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3254601"
    }
  }
}