{
  "data": {
    "type": "provider-docs",
    "id": "3254550",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"Network Firewall\"\nlayout: \"aws\"\npage_title: \"AWS: aws_networkfirewall_firewall\"\ndescription: |-\n  Retrieve information about an AWS Network Firewall Firewall resource.\n---\n\n# Data Source: aws_networkfirewall_firewall\n\nRetrieve information about a firewall.\n\n## Example Usage\n\n### Find firewall policy by ARN\n\n```hcl\ndata \"aws_networkfirewall_firewall\" \"example\" {\n  arn = aws_networkfirewall_firewall.arn\n}\n```\n\n### Find firewall policy by Name\n\n```hcl\ndata \"aws_networkfirewall_firewall\" \"example\" {\n  name = \"Test\"\n}\n```\n\n### Find firewall policy by ARN and Name\n\n```hcl\ndata \"aws_networkfirewall_firewall\" \"example\" {\n  arn  = aws_networkfirewall_firewall.arn\n  name = \"Test\"\n}\n```\n\n## Argument Reference\n\nOne or more of the following arguments are required:\n\n* `arn` - ARN of the firewall.\n* `name` - Descriptive name of the firewall.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `arn` - ARN of the firewall.\n* `delete_protection` - Boolean flag indicating whether it is possible to delete the firewall.\n* `description` - Description of the firewall.\n* `encryption_configuration` - AWS Key Management Service (AWS KMS) encryption settings for the firewall.\n    * `key_id` - The ID of the AWS Key Management Service (AWS KMS) customer managed key.\n    * `type` - The type of the AWS Key Management Service (AWS KMS) key use by the firewall.\n* `firewall_policy_arn` - ARN of the VPC Firewall policy.\n* `firewall_policy_change_protection` - A boolean flag indicating whether it is possible to change the associated firewall policy.\n* `firewall_status` - Nested list of information about the current status of the firewall.\n    * `sync_states` - Set of subnets configured for use by the firewall.\n        * `attachment` - Nested list describing the attachment status of the firewall's association with a single VPC subnet.\n            * `endpoint_id` - The identifier of the firewall endpoint that AWS Network Firewall has instantiated in the subnet. You use this to identify the firewall endpoint in the VPC route tables, when you redirect the VPC traffic through the endpoint.\n            * `subnet_id` - The unique identifier of the subnet that you've specified to be used for a firewall endpoint.\n        * `availability_zone` - The Availability Zone where the subnet is configured.\n    * `capacity_usage_summary` - Aggregated count of all resources used by reference sets in a firewall.\n        * `cidrs` - Capacity usage of CIDR blocks used by IP set references in a firewall.\n            * `available_cidr_count` - Available number of CIDR blocks available for use by the IP set references in a firewall.\n            * `ip_set_references` - The list of IP set references used by a firewall.\n                * `resolved_cidr_count` - Total number of CIDR blocks used by the IP set references in a firewall.\n            * `utilized_cidr_count` - Number of CIDR blocks used by the IP set references in a firewall.\n    * `configuration_sync_state_summary` - Summary of sync states for all availability zones in which the firewall is configured.\n* `id` - ARN that identifies the firewall.\n* `name` - Descriptive name of the firewall.\n* `subnet_change_protection` - A boolean flag indicating whether it is possible to change the associated subnet(s).\n* `subnet_mapping` - Set of configuration blocks describing the public subnets. Each subnet must belong to a different Availability Zone in the VPC. AWS Network Firewall creates a firewall endpoint in each subnet.\n    * `subnet_id` - The unique identifier for the subnet.\n* `tags` - Map of resource tags to associate with the resource. If configured with a provider [`default_tags` configuration block](/docs/providers/aws/index.html#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n* `update_token` - String token used when updating a firewall.\n* `vpc_id` - Unique identifier of the VPC where AWS Network Firewall should create the firewall.\n",
      "language": "hcl",
      "path": "website/docs/d/networkfirewall_firewall.html.markdown",
      "slug": "networkfirewall_firewall",
      "subcategory": "Network Firewall",
      "title": "networkfirewall_firewall",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3254550"
    }
  }
}