{
  "data": {
    "type": "provider-docs",
    "id": "3254733",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"WorkSpaces\"\nlayout: \"aws\"\npage_title: \"AWS: aws_workspaces_directory\"\ndescription: |-\n  Retrieve information about an AWS WorkSpaces directory.\n---\n\n# Data Source: aws_workspaces_directory\n\nRetrieve information about an AWS WorkSpaces directory.\n\n## Example Usage\n\n```terraform\ndata \"aws_workspaces_directory\" \"example\" {\n  directory_id = \"d-9067783251\"\n}\n```\n\n## Argument Reference\n\n* `directory_id` - (Required) Directory identifier for registration in WorkSpaces service.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `id` - WorkSpaces directory identifier.\n* `alias` - Directory alias.\n* `customer_user_name` - User name for the service account.\n* `directory_name` - Name of the directory.\n* `directory_type` - Directory type.\n* `dns_ip_addresses` - IP addresses of the DNS servers for the directory.\n* `iam_role_id` - Identifier of the IAM role. This is the role that allows Amazon WorkSpaces to make calls to other services, such as Amazon EC2, on your behalf.\n* `ip_group_ids` - Identifiers of the IP access control groups associated with the directory.\n* `registration_code` - Registration code for the directory. This is the code that users enter in their Amazon WorkSpaces client application to connect to the directory.\n* `self_service_permissions` – The permissions to enable or disable self-service capabilities.\n* `subnet_ids` - Identifiers of the subnets where the directory resides.\n* `tags` – A map of tags assigned to the WorkSpaces directory.\n* `workspace_creation_properties` – The default properties that are used for creating WorkSpaces. Defined below.\n* `workspace_access_properties` – (Optional) Specifies which devices and operating systems users can use to access their WorkSpaces. Defined below.\n* `workspace_security_group_id` - The identifier of the security group that is assigned to new WorkSpaces. Defined below.\n\n### self_service_permissions\n\n* `change_compute_type` – Whether WorkSpaces directory users can change the compute type (bundle) for their workspace.\n* `increase_volume_size` – Whether WorkSpaces directory users can increase the volume size of the drives on their workspace.\n* `rebuild_workspace` – Whether WorkSpaces directory users can rebuild the operating system of a workspace to its original state.\n* `restart_workspace` – Whether WorkSpaces directory users can restart their workspace.\n* `switch_running_mode` – Whether WorkSpaces directory users can switch the running mode of their workspace.\n\n### workspace_access_properties\n\n* `device_type_android` – (Optional) Indicates whether users can use Android devices to access their WorkSpaces.\n* `device_type_chromeos` – (Optional) Indicates whether users can use Chromebooks to access their WorkSpaces.\n* `device_type_ios` – (Optional) Indicates whether users can use iOS devices to access their WorkSpaces.\n* `device_type_linux` – (Optional) Indicates whether users can use Linux clients to access their WorkSpaces.\n* `device_type_osx` – (Optional) Indicates whether users can use macOS clients to access their WorkSpaces.\n* `device_type_web` – (Optional) Indicates whether users can access their WorkSpaces through a web browser.\n* `device_type_windows` – (Optional) Indicates whether users can use Windows clients to access their WorkSpaces.\n* `device_type_zeroclient` – (Optional) Indicates whether users can use zero client devices to access their WorkSpaces.\n\n### workspace_creation_properties\n\n* `custom_security_group_id` – The identifier of your custom security group. Should relate to the same VPC, where workspaces reside in.\n* `default_ou` – The default organizational unit (OU) for your WorkSpace directories.\n* `enable_internet_access` – Indicates whether internet access is enabled for your WorkSpaces.\n* `enable_maintenance_mode` – Indicates whether maintenance mode is enabled for your WorkSpaces. For more information, see [WorkSpace Maintenance](https://docs.aws.amazon.com/workspaces/latest/adminguide/workspace-maintenance.html).\n* `user_enabled_as_local_administrator` – Indicates whether users are local administrators of their WorkSpaces.\n",
      "language": "hcl",
      "path": "website/docs/d/workspaces_directory.html.markdown",
      "slug": "workspaces_directory",
      "subcategory": "WorkSpaces",
      "title": "workspaces_directory",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3254733"
    }
  }
}