{
  "data": {
    "type": "provider-docs",
    "id": "3255418",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"Lex Model Building\"\nlayout: \"aws\"\npage_title: \"AWS: aws_lex_intent\"\ndescription: |-\n  Provides an Amazon Lex intent resource.\n---\n\n# Resource: aws_lex_intent\n\nProvides an Amazon Lex Intent resource. For more information see\n[Amazon Lex: How It Works](https://docs.aws.amazon.com/lex/latest/dg/how-it-works.html)\n\n## Example Usage\n\n```terraform\nresource \"aws_lex_intent\" \"order_flowers_intent\" {\n  confirmation_prompt {\n    max_attempts = 2\n\n    message {\n      content      = \"Okay, your {FlowerType} will be ready for pickup by {PickupTime} on {PickupDate}.  Does this sound okay?\"\n      content_type = \"PlainText\"\n    }\n  }\n\n  create_version = false\n  name           = \"OrderFlowers\"\n  description    = \"Intent to order a bouquet of flowers for pick up\"\n\n  fulfillment_activity {\n    type = \"ReturnIntent\"\n  }\n\n  rejection_statement {\n    message {\n      content      = \"Okay, I will not place your order.\"\n      content_type = \"PlainText\"\n    }\n  }\n\n  sample_utterances = [\n    \"I would like to order some flowers\",\n    \"I would like to pick up flowers\",\n  ]\n\n  slot {\n    description = \"The type of flowers to pick up\"\n    name        = \"FlowerType\"\n    priority    = 1\n\n    sample_utterances = [\n      \"I would like to order {FlowerType}\",\n    ]\n\n    slot_constraint   = \"Required\"\n    slot_type         = \"FlowerTypes\"\n    slot_type_version = \"$$LATEST\"\n\n    value_elicitation_prompt {\n      max_attempts = 2\n\n      message {\n        content      = \"What type of flowers would you like to order?\"\n        content_type = \"PlainText\"\n      }\n    }\n  }\n\n  slot {\n    description = \"The date to pick up the flowers\"\n    name        = \"PickupDate\"\n    priority    = 2\n\n    sample_utterances = [\n      \"I would like to order {FlowerType}\",\n    ]\n\n    slot_constraint   = \"Required\"\n    slot_type         = \"AMAZON.DATE\"\n    slot_type_version = \"$$LATEST\"\n\n    value_elicitation_prompt {\n      max_attempts = 2\n\n      message {\n        content      = \"What day do you want the {FlowerType} to be picked up?\"\n        content_type = \"PlainText\"\n      }\n    }\n  }\n\n  slot {\n    description = \"The time to pick up the flowers\"\n    name        = \"PickupTime\"\n    priority    = 3\n\n    sample_utterances = [\n      \"I would like to order {FlowerType}\",\n    ]\n\n    slot_constraint   = \"Required\"\n    slot_type         = \"AMAZON.TIME\"\n    slot_type_version = \"$$LATEST\"\n\n    value_elicitation_prompt {\n      max_attempts = 2\n\n      message {\n        content      = \"Pick up the {FlowerType} at what time on {PickupDate}?\"\n        content_type = \"PlainText\"\n      }\n    }\n  }\n}\n```\n\n## Argument Reference\n\nThis resource supports the following arguments:\n\n* `conclusion_statement` - (Optional) The statement that you want Amazon Lex to convey to the user\nafter the intent is successfully fulfilled by the Lambda function. This element is relevant only if\nyou provide a Lambda function in the `fulfillment_activity`. If you return the intent to the client\napplication, you can't specify this element. The `follow_up_prompt` and `conclusion_statement` are\nmutually exclusive. You can specify only one. Attributes are documented under [statement](#statement).\n* `confirmation_prompt` - (Optional) Prompts the user to confirm the intent. This question should\nhave a yes or no answer. You you must provide both the `rejection_statement` and `confirmation_prompt`,\nor neither. Attributes are documented under [prompt](#prompt).\n* `create_version` - (Optional) Determines if a new slot type version is created when the initial\nresource is created and on each update. Defaults to `false`.\n* `description` - (Optional) A description of the intent. Must be less than or equal to 200 characters in length.\n* `dialog_code_hook` - (Optional) Specifies a Lambda function to invoke for each user input. You can\ninvoke this Lambda function to personalize user interaction. Attributes are documented under [code_hook](#code_hook).\n* `follow_up_prompt` - (Optional) Amazon Lex uses this prompt to solicit additional activity after\nfulfilling an intent. For example, after the OrderPizza intent is fulfilled, you might prompt the\nuser to order a drink. The `follow_up_prompt` field and the `conclusion_statement` field are mutually\nexclusive. You can specify only one. Attributes are documented under [follow_up_prompt](#follow_up_prompt).\n* `fulfillment_activity` - (Required) Describes how the intent is fulfilled. For example, after a\nuser provides all of the information for a pizza order, `fulfillment_activity` defines how the bot\nplaces an order with a local pizza store. Attributes are documented under [fulfillment_activity](#fulfillment_activity).\n* `name` - (Required) The name of the intent, not case sensitive. Must be less than or equal to 100 characters in length.\n* `parent_intent_signature` - (Optional) A unique identifier for the built-in intent to base this\nintent on. To find the signature for an intent, see\n[Standard Built-in Intents](https://developer.amazon.com/public/solutions/alexa/alexa-skills-kit/docs/built-in-intent-ref/standard-intents)\nin the Alexa Skills Kit.\n* `rejection_statement` - (Optional) When the user answers \"no\" to the question defined in\n`confirmation_prompt`, Amazon Lex responds with this statement to acknowledge that the intent was\ncanceled. You must provide both the `rejection_statement` and the `confirmation_prompt`, or neither.\nAttributes are documented under [statement](#statement).\n* `sample_utterances` - (Optional) An array of utterances (strings) that a user might say to signal\nthe intent. For example, \"I want {PizzaSize} pizza\", \"Order {Quantity} {PizzaSize} pizzas\".\nIn each utterance, a slot name is enclosed in curly braces. Must have between 1 and 10 items in the list, and each item must be less than or equal to 200 characters in length.\n* `slot` - (Optional) An list of intent slots. At runtime, Amazon Lex elicits required slot values\nfrom the user using prompts defined in the slots. Attributes are documented under [slot](#slot).\n\n### code_hook\n\nSpecifies a Lambda function that verifies requests to a bot or fulfills the user's request to a bot.\n\n* `message_version` - (Required) The version of the request-response that you want Amazon Lex to use\nto invoke your Lambda function. For more information, see\n[Using Lambda Functions](https://docs.aws.amazon.com/lex/latest/dg/using-lambda.html). Must be less than or equal to 5 characters in length.\n* `uri` - (Required) The Amazon Resource Name (ARN) of the Lambda function.\n\n### follow_up_prompt\n\nA prompt for additional activity after an intent is fulfilled. For example, after the OrderPizza\nintent is fulfilled, you might prompt the user to find out whether the user wants to order drinks.\n\n* `prompt` - (Required) Prompts for information from the user. Attributes are documented under [prompt](#prompt).\n* `rejection_statement` - (Optional) If the user answers \"no\" to the question defined in the prompt field,\nAmazon Lex responds with this statement to acknowledge that the intent was canceled. Attributes are\ndocumented below under [statement](#statement).\n\n### fulfillment_activity\n\nDescribes how the intent is fulfilled after the user provides all of the information required for the intent.\n\n* `type` - (Required) How the intent should be fulfilled, either by running a Lambda function or by\nreturning the slot data to the client application. Type can be either `ReturnIntent` or `CodeHook`, as documented [here](https://docs.aws.amazon.com/lex/latest/dg/API_FulfillmentActivity.html).\n* `code_hook` - (Optional) A description of the Lambda function that is run to fulfill the intent.\nRequired if type is CodeHook. Attributes are documented under [code_hook](#code_hook).\n\n### message\n\nThe message object that provides the message text and its type.\n\n* `content` - (Required) The text of the message. Must be less than or equal to 1000 characters in length.\n* `content_type` - (Required) The content type of the message string.\n* `group_number` - (Optional) Identifies the message group that the message belongs to. When a group\nis assigned to a message, Amazon Lex returns one message from each group in the response. Must be a number between 1 and 5 (inclusive).\n\n### prompt\n\nObtains information from the user. To define a prompt, provide one or more messages and specify the\nnumber of attempts to get information from the user. If you provide more than one message, Amazon\nLex chooses one of the messages to use to prompt the user.\n\n* `max_attempts` - (Required) The number of times to prompt the user for information. Must be a number between 1 and 5 (inclusive).\n* `message` - (Required) A set of messages, each of which provides a message string and its type.\nYou can specify the message string in plain text or in Speech Synthesis Markup Language (SSML).\nAttributes are documented under [message](#message). Must contain between 1 and 15 messages.\n* `response_card` - (Optional) The response card. Amazon Lex will substitute session attributes and\nslot values into the response card. For more information, see\n[Example: Using a Response Card](https://docs.aws.amazon.com/lex/latest/dg/ex-resp-card.html). Must be less than or equal to 50000 characters in length.\n\n### slot\n\nIdentifies the version of a specific slot.\n\n* `name` - (Required) The name of the intent slot that you want to create. The name is case sensitive. Must be less than or equal to 100 characters in length.\n* `slot_constraint` - (Required) Specifies whether the slot is required or optional.\n* `description` - (Optional) A description of the bot. Must be less than or equal to 200 characters in length.\n* `priority` - (Optional) Directs Lex the order in which to elicit this slot value from the user.\nFor example, if the intent has two slots with priorities 1 and 2, AWS Lex first elicits a value for\nthe slot with priority 1. If multiple slots share the same priority, the order in which Lex elicits\nvalues is arbitrary. Must be between 1 and 100.\n* `response_card` - (Optional) The response card. Amazon Lex will substitute session attributes and\nslot values into the response card. For more information, see\n[Example: Using a Response Card](https://docs.aws.amazon.com/lex/latest/dg/ex-resp-card.html). Must be less than or equal to 50000 characters in length.\n* `sample_utterances` - (Optional) If you know a specific pattern with which users might respond to\nan Amazon Lex request for a slot value, you can provide those utterances to improve accuracy. This\nis optional. In most cases, Amazon Lex is capable of understanding user utterances. Must have between 1 and 10 items in the list, and each item must be less than or equal to 200 characters in length.\n* `slot_type` - (Optional) The type of the slot, either a custom slot type that you defined or one of\nthe built-in slot types. Must be less than or equal to 100 characters in length.\n* `slot_type_version` - (Optional) The version of the slot type. Must be less than or equal to 64 characters in length.\n* `value_elicitation_prompt` - (Optional) The prompt that Amazon Lex uses to elicit the slot value\nfrom the user. Attributes are documented under [prompt](#prompt).\n\n### statement\n\nA statement is a map with a set of message maps and an optional response card string. Messages\nconvey information to the user. At runtime, Amazon Lex selects the message to convey.\n\n* `message` - (Required) A set of messages, each of which provides a message string and its type.\nYou can specify the message string in plain text or in Speech Synthesis Markup Language (SSML).\nAttributes are documented under [message](#message). Must contain between 1 and 15 messages.\n* `response_card` - (Optional) The response card. Amazon Lex will substitute session attributes and\nslot values into the response card. For more information, see\n[Example: Using a Response Card](https://docs.aws.amazon.com/lex/latest/dg/ex-resp-card.html). Must be less than or equal to 50000 characters in length.\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - The ARN of the Lex intent.\n* `checksum` - Checksum identifying the version of the intent that was created. The checksum is not\nincluded as an argument because the resource will add it automatically when updating the intent.\n* `created_date` - The date when the intent version was created.\n* `last_updated_date` - The date when the $LATEST version of this intent was updated.\n* `version` - The version of the bot.\n\n## Timeouts\n\n[Configuration options](https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts):\n\n* `create` - (Default `1m`)\n* `update` - (Default `1m`)\n* `delete` - (Default `5m`)\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import intents using their name. For example:\n\n```terraform\nimport {\n  to = aws_lex_intent.order_flowers_intent\n  id = \"OrderFlowers\"\n}\n```\n\nUsing `terraform import`, import intents using their name. For example:\n\n```console\n% terraform import aws_lex_intent.order_flowers_intent OrderFlowers\n```\n",
      "language": "hcl",
      "path": "website/docs/r/lex_intent.html.markdown",
      "slug": "lex_intent",
      "subcategory": "Lex Model Building",
      "title": "lex_intent",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3255418"
    }
  }
}