{
  "data": {
    "type": "provider-docs",
    "id": "3255050",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"VPC (Virtual Private Cloud)\"\nlayout: \"aws\"\npage_title: \"AWS: aws_default_network_acl\"\ndescription: |-\n  Manage a default network ACL.\n---\n\n# Resource: aws_default_network_acl\n\nProvides a resource to manage a VPC's default network ACL. This resource can manage the default network ACL of the default or a non-default VPC.\n\n~> **NOTE:** This is an advanced resource with special caveats. Please read this document in its entirety before using this resource. The `aws_default_network_acl` behaves differently from normal resources. Terraform does not _create_ this resource but instead attempts to \"adopt\" it into management.\n\nEvery VPC has a default network ACL that can be managed but not destroyed. When Terraform first adopts the Default Network ACL, it **immediately removes all rules in the ACL**. It then proceeds to create any rules specified in the configuration. This step is required so that only the rules specified in the configuration are created.\n\nThis resource treats its inline rules as absolute; only the rules defined inline are created, and any additions/removals external to this resource will result in diffs being shown. For these reasons, this resource is incompatible with the `aws_network_acl_rule` resource.\n\nFor more information about Network ACLs, see the AWS Documentation on [Network ACLs][aws-network-acls].\n\n## Example Usage\n\n### Basic Example\n\nThe following config gives the Default Network ACL the same rules that AWS includes but pulls the resource under management by Terraform. This means that any ACL rules added or changed will be detected as drift.\n\n```terraform\nresource \"aws_vpc\" \"mainvpc\" {\n  cidr_block = \"10.1.0.0/16\"\n}\n\nresource \"aws_default_network_acl\" \"default\" {\n  default_network_acl_id = aws_vpc.mainvpc.default_network_acl_id\n\n  ingress {\n    protocol   = -1\n    rule_no    = 100\n    action     = \"allow\"\n    cidr_block = \"0.0.0.0/0\"\n    from_port  = 0\n    to_port    = 0\n  }\n\n  egress {\n    protocol   = -1\n    rule_no    = 100\n    action     = \"allow\"\n    cidr_block = \"0.0.0.0/0\"\n    from_port  = 0\n    to_port    = 0\n  }\n}\n```\n\n### Example: Deny All Egress Traffic, Allow Ingress\n\nThe following denies all Egress traffic by omitting any `egress` rules, while including the default `ingress` rule to allow all traffic.\n\n```terraform\nresource \"aws_vpc\" \"mainvpc\" {\n  cidr_block = \"10.1.0.0/16\"\n}\n\nresource \"aws_default_network_acl\" \"default\" {\n  default_network_acl_id = aws_vpc.mainvpc.default_network_acl_id\n\n  ingress {\n    protocol   = -1\n    rule_no    = 100\n    action     = \"allow\"\n    cidr_block = aws_default_vpc.mainvpc.cidr_block\n    from_port  = 0\n    to_port    = 0\n  }\n}\n```\n\n### Example: Deny All Traffic To Any Subnet In The Default Network ACL\n\nThis config denies all traffic in the Default ACL. This can be useful if you want to lock down the VPC to force all resources to assign a non-default ACL.\n\n```terraform\nresource \"aws_vpc\" \"mainvpc\" {\n  cidr_block = \"10.1.0.0/16\"\n}\n\nresource \"aws_default_network_acl\" \"default\" {\n  default_network_acl_id = aws_vpc.mainvpc.default_network_acl_id\n\n  # no rules defined, deny all traffic in this ACL\n}\n```\n\n### Managing Subnets In A Default Network ACL\n\nWithin a VPC, all Subnets must be associated with a Network ACL. In order to \"delete\" the association between a Subnet and a non-default Network ACL, the association is destroyed by replacing it with an association between the Subnet and the Default ACL instead.\n\nWhen managing the Default Network ACL, you cannot \"remove\" Subnets. Instead, they must be reassigned to another Network ACL, or the Subnet itself must be destroyed. Because of these requirements, removing the `subnet_ids` attribute from the configuration of a `aws_default_network_acl` resource may result in a reoccurring plan, until the Subnets are reassigned to another Network ACL or are destroyed.\n\nBecause Subnets are by default associated with the Default Network ACL, any non-explicit association will show up as a plan to remove the Subnet. For example: if you have a custom `aws_network_acl` with two subnets attached, and you remove the `aws_network_acl` resource, after successfully destroying this resource future plans will show a diff on the managed `aws_default_network_acl`, as those two Subnets have been orphaned by the now destroyed network acl and thus adopted by the Default Network ACL. In order to avoid a reoccurring plan, they will need to be reassigned, destroyed, or added to the `subnet_ids` attribute of the `aws_default_network_acl` entry.\n\nAs an alternative to the above, you can also specify the following lifecycle configuration in your `aws_default_network_acl` resource:\n\n```terraform\nresource \"aws_default_network_acl\" \"default\" {\n  # ... other configuration ...\n\n  lifecycle {\n    ignore_changes = [subnet_ids]\n  }\n}\n```\n\n### Removing `aws_default_network_acl` From Your Configuration\n\nEach AWS VPC comes with a Default Network ACL that cannot be deleted. The `aws_default_network_acl` allows you to manage this Network ACL, but Terraform cannot destroy it. Removing this resource from your configuration will remove it from your statefile and management, **but will not destroy the Network ACL.** All Subnets associations and ingress or egress rules will be left as they are at the time of removal. You can resume managing them via the AWS Console.\n\n## Argument Reference\n\nThe following arguments are required:\n\n* `default_network_acl_id` - (Required) Network ACL ID to manage. This attribute is exported from `aws_vpc`, or manually found via the AWS Console.\n\nThe following arguments are optional:\n\n* `egress` - (Optional) Configuration block for an egress rule. Detailed below.\n* `ingress` - (Optional) Configuration block for an ingress rule. Detailed below.\n* `subnet_ids` - (Optional) List of Subnet IDs to apply the ACL to. See the notes above on Managing Subnets in the Default Network ACL\n* `tags` - (Optional) Map of tags to assign to the resource. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n\n### egress and ingress\n\nBoth the `egress` and `ingress` configuration blocks have the same arguments.\n\nThe following arguments are required:\n\n* `action` - (Required) The action to take.\n* `from_port` - (Required) The from port to match.\n* `protocol` - (Required) The protocol to match. If using the -1 'all' protocol, you must specify a from and to port of 0.\n* `rule_no` - (Required) The rule number. Used for ordering.\n* `to_port` - (Required) The to port to match.\n\nThe following arguments are optional:\n\n* `cidr_block` - (Optional) The CIDR block to match. This must be a valid network mask.\n* `icmp_code` - (Optional) The ICMP type code to be used. Default 0.\n* `icmp_type` - (Optional) The ICMP type to be used. Default 0.\n* `ipv6_cidr_block` - (Optional) The IPv6 CIDR block.\n\n-> For more information on ICMP types and codes, see [Internet Control Message Protocol (ICMP) Parameters](https://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml).\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - ARN of the Default Network ACL\n* `id` - ID of the Default Network ACL\n* `owner_id` - ID of the AWS account that owns the Default Network ACL\n* `tags_all` - A map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block).\n* `vpc_id` -  ID of the associated VPC\n\n[aws-network-acls]: http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_ACLs.html\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import Default Network ACLs using the `id`. For example:\n\n```terraform\nimport {\n  to = aws_default_network_acl.sample\n  id = \"acl-7aaabd18\"\n}\n```\n\nUsing `terraform import`, import Default Network ACLs using the `id`. For example:\n\n```console\n% terraform import aws_default_network_acl.sample acl-7aaabd18\n```\n",
      "language": "hcl",
      "path": "website/docs/r/default_network_acl.html.markdown",
      "slug": "default_network_acl",
      "subcategory": "VPC (Virtual Private Cloud)",
      "title": "default_network_acl",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3255050"
    }
  }
}