{
  "data": {
    "type": "provider-docs",
    "id": "3255554",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"OpsWorks\"\nlayout: \"aws\"\npage_title: \"AWS: aws_opsworks_java_app_layer\"\ndescription: |-\n  Provides an OpsWorks Java application layer resource.\n---\n\n# Resource: aws_opsworks_java_app_layer\n\nProvides an OpsWorks Java application layer resource.\n\n## Example Usage\n\n```terraform\nresource \"aws_opsworks_java_app_layer\" \"app\" {\n  stack_id = aws_opsworks_stack.main.id\n}\n```\n\n## Argument Reference\n\nThis resource supports the following arguments:\n\n* `stack_id` - (Required) ID of the stack the layer will belong to.\n* `name` - (Optional) A human-readable name for the layer.\n* `app_server` - (Optional) Keyword for the application container to use. Defaults to \"tomcat\".\n* `app_server_version` - (Optional) Version of the selected application container to use. Defaults to \"7\".\n* `auto_assign_elastic_ips` - (Optional) Whether to automatically assign an elastic IP address to the layer's instances.\n* `auto_assign_public_ips` - (Optional) For stacks belonging to a VPC, whether to automatically assign a public IP address to each of the layer's instances.\n* `custom_instance_profile_arn` - (Optional) The ARN of an IAM profile that will be used for the layer's instances.\n* `custom_security_group_ids` - (Optional) Ids for a set of security groups to apply to the layer's instances.\n* `auto_healing` - (Optional) Whether to enable auto-healing for the layer.\n* `install_updates_on_boot` - (Optional) Whether to install OS and package updates on each instance when it boots.\n* `instance_shutdown_timeout` - (Optional) The time, in seconds, that OpsWorks will wait for Chef to complete after triggering the Shutdown event.\n* `jvm_type` - (Optional) Keyword for the type of JVM to use. Defaults to `openjdk`.\n* `jvm_options` - (Optional) Options to set for the JVM.\n* `jvm_version` - (Optional) Version of JVM to use. Defaults to \"7\".\n* `elastic_load_balancer` - (Optional) Name of an Elastic Load Balancer to attach to this layer\n* `drain_elb_on_shutdown` - (Optional) Whether to enable Elastic Load Balancing connection draining.\n* `system_packages` - (Optional) Names of a set of system packages to install on the layer's instances.\n* `use_ebs_optimized_instances` - (Optional) Whether to use EBS-optimized instances.\n* `ebs_volume` - (Optional) `ebs_volume` blocks, as described below, will each create an EBS volume and connect it to the layer's instances.\n* `custom_json` - (Optional) Custom JSON attributes to apply to the layer.\n* `tags` - (Optional) A map of tags to assign to the resource. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n\nThe following extra optional arguments, all lists of Chef recipe names, allow\ncustom Chef recipes to be applied to layer instances at the five different\nlifecycle events, if custom cookbooks are enabled on the layer's stack:\n\n* `custom_configure_recipes`\n* `custom_deploy_recipes`\n* `custom_setup_recipes`\n* `custom_shutdown_recipes`\n* `custom_undeploy_recipes`\n\nAn `ebs_volume` block supports the following arguments:\n\n* `mount_point` - (Required) The path to mount the EBS volume on the layer's instances.\n* `size` - (Required) The size of the volume in gigabytes.\n* `number_of_disks` - (Required) The number of disks to use for the EBS volume.\n* `raid_level` - (Required) The RAID level to use for the volume.\n* `type` - (Optional) The type of volume to create. This may be `standard` (the default), `io1` or `gp2`.\n* `iops` - (Optional) For PIOPS volumes, the IOPS per disk.\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `id` - The id of the layer.\n* `arn` - The Amazon Resource Name(ARN) of the layer.\n* `tags_all` - A map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block).\n",
      "language": "hcl",
      "path": "website/docs/r/opsworks_java_app_layer.html.markdown",
      "slug": "opsworks_java_app_layer",
      "subcategory": "OpsWorks",
      "title": "opsworks_java_app_layer",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3255554"
    }
  }
}