{
  "data": {
    "type": "provider-docs",
    "id": "3255692",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"CloudWatch RUM\"\nlayout: \"aws\"\npage_title: \"AWS: aws_rum_app_monitor\"\ndescription: |-\n  Provides a CloudWatch RUM App Monitor resource.\n---\n\n# Resource: aws_rum_app_monitor\n\nProvides a CloudWatch RUM App Monitor resource.\n\n## Example Usage\n\n```terraform\nresource \"aws_rum_app_monitor\" \"example\" {\n  name   = \"example\"\n  domain = \"localhost\"\n}\n```\n\n## Argument Reference\n\nThis resource supports the following arguments:\n\n* `name` - (Required) The name of the log stream.\n* `domain` - (Required) The top-level internet domain name for which your application has administrative authority.\n* `app_monitor_configuration` - (Optional) configuration data for the app monitor. See [app_monitor_configuration](#app_monitor_configuration) below.\n* `cw_log_enabled` - (Optional) Data collected by RUM is kept by RUM for 30 days and then deleted. This parameter  specifies whether RUM sends a copy of this telemetry data to Amazon CloudWatch Logs in your account. This enables you to keep the telemetry data for more than 30 days, but it does incur Amazon CloudWatch Logs charges. Default value is `false`.\n* `custom_events` - (Optional) Specifies whether this app monitor allows the web client to define and send custom events. If you omit this parameter, custom events are `DISABLED`. See [custom_events](#custom_events) below.\n* `tags` - (Optional) A map of tags to assign to the resource. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n\n### app_monitor_configuration\n\n* `allow_cookies` - (Optional) If you set this to `true`, RUM web client sets two cookies, a session cookie  and a user cookie. The cookies allow the RUM web client to collect data relating to the number of users an application has and the behavior of the application across a sequence of events. Cookies are stored in the top-level domain of the current page.\n* `enable_xray` - (Optional) If you set this to `true`, RUM enables X-Ray tracing for the user sessions  that RUM samples. RUM adds an X-Ray trace header to allowed HTTP requests. It also records an X-Ray segment for allowed HTTP requests.\n* `excluded_pages` - (Optional) A list of URLs in your website or application to exclude from RUM data collection.\n* `favorite_pages` - (Optional) A list of pages in the CloudWatch RUM console that are to be displayed with a \"favorite\" icon.\n* `guest_role_arn` - (Optional) The ARN of the guest IAM role that is attached to the Amazon Cognito identity pool that is used to authorize the sending of data to RUM.\n* `identity_pool_id` - (Optional) The ID of the Amazon Cognito identity pool that is used to authorize the sending of data to RUM.\n* `included_pages` - (Optional)  If this app monitor is to collect data from only certain pages in your application, this structure lists those pages.\n* `session_sample_rate` - (Optional) Specifies the percentage of user sessions to use for RUM data collection. Choosing a higher percentage gives you more data but also incurs more costs. The number you specify is the percentage of user sessions that will be used. Default value is `0.1`.\n* `telemetries` - (Optional) An array that lists the types of telemetry data that this app monitor is to collect. Valid values are `errors`, `performance`, and `http`.\n\n### custom_events\n\n* `status` - (Optional) Specifies whether this app monitor allows the web client to define and send custom events. The default is for custom events to be `DISABLED`. Valid values are `DISABLED` and `ENABLED`.\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - The Amazon Resource Name (ARN) specifying the app monitor.\n* `id` - The CloudWatch RUM name as it is the identifier of a RUM.\n* `app_monitor_id` - The unique ID of the app monitor. Useful for JS templates.\n* `cw_log_group` - The name of the log group where the copies are stored.\n* `tags_all` - A map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block).\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import Cloudwatch RUM App Monitor using the `name`. For example:\n\n```terraform\nimport {\n  to = aws_rum_app_monitor.example\n  id = \"example\"\n}\n```\n\nUsing `terraform import`, import Cloudwatch RUM App Monitor using the `name`. For example:\n\n```console\n% terraform import aws_rum_app_monitor.example example\n```\n",
      "language": "hcl",
      "path": "website/docs/r/rum_app_monitor.html.markdown",
      "slug": "rum_app_monitor",
      "subcategory": "CloudWatch RUM",
      "title": "rum_app_monitor",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3255692"
    }
  }
}