{
  "data": {
    "type": "provider-docs",
    "id": "3255229",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"FinSpace\"\nlayout: \"aws\"\npage_title: \"AWS: aws_finspace_kx_cluster\"\ndescription: |-\n  Terraform resource for managing an AWS FinSpace Kx Cluster.\n---\n\n# Resource: aws_finspace_kx_cluster\n\nTerraform resource for managing an AWS FinSpace Kx Cluster.\n\n## Example Usage\n\n### Basic Usage\n\n```terraform\nresource \"aws_finspace_kx_cluster\" \"example\" {\n  name                 = \"my-tf-kx-cluster\"\n  environment_id       = aws_finspace_kx_environment.example.id\n  type                 = \"HDB\"\n  release_label        = \"1.0\"\n  az_mode              = \"SINGLE\"\n  availability_zone_id = \"use1-az2\"\n\n  capacity_configuration {\n    node_type  = \"kx.s.2xlarge\"\n    node_count = 2\n  }\n\n  vpc_configuration {\n    vpc_id             = aws_vpc.test.id\n    security_group_ids = [aws_security_group.example.id]\n    subnet_ids         = [aws_subnet.example.id]\n    ip_address_type    = \"IP_V4\"\n  }\n\n  cache_storage_configurations {\n    type = \"CACHE_1000\"\n    size = 1200\n  }\n\n  database {\n    database_name = aws_finspace_kx_database.example.name\n    cache_configuration {\n      cache_type = \"CACHE_1000\"\n      db_paths   = \"/\"\n    }\n  }\n\n  code {\n    s3_bucket = aws_s3_bucket.test.id\n    s3_key    = aws_s3_object.object.key\n  }\n}\n```\n\n## Argument Reference\n\nThe following arguments are required:\n\n* `az_mode` - (Required) The number of availability zones you want to assign per cluster. This can be one of the following:\n    * SINGLE - Assigns one availability zone per cluster.\n    * MULTI - Assigns all the availability zones per cluster.\n* `capacity_configuration` - (Required) Structure for the metadata of a cluster. Includes information like the CPUs needed, memory of instances, and number of instances. See [capacity_configuration](#capacity_configuration).\n* `environment_id` - (Required) Unique identifier for the KX environment.\n* `name` - (Required) Unique name for the cluster that you want to create.\n* `release_label` - (Required) Version of FinSpace Managed kdb to run.\n* `type` - (Required) Type of KDB database. The following types are available:\n    * HDB - Historical Database. The data is only accessible with read-only permissions from one of the FinSpace managed KX databases mounted to the cluster.\n    * RDB - Realtime Database. This type of database captures all the data from a ticker plant and stores it in memory until the end of day, after which it writes all of its data to a disk and reloads the HDB. This cluster type requires local storage for temporary storage of data during the savedown process. If you specify this field in your request, you must provide the `savedownStorageConfiguration` parameter.\n    * GATEWAY - A gateway cluster allows you to access data across processes in kdb systems. It allows you to create your own routing logic using the initialization scripts and custom code. This type of cluster does not require a  writable local storage.\n* `vpc_configuration` - (Required) Configuration details about the network where the Privatelink endpoint of the cluster resides. See [vpc_configuration](#vpc_configuration).\n\nThe following arguments are optional:\n\n* `auto_scaling_configuration` - (Optional) Configuration based on which FinSpace will scale in or scale out nodes in your cluster. See [auto_scaling_configuration](#auto_scaling_configuration).\n* `availability_zone_id` - (Optional) The availability zone identifiers for the requested regions. Required when `az_mode` is set to SINGLE.\n* `cache_storage_configurations` - (Optional) Configurations for a read only cache storage associated with a cluster. This cache will be stored as an FSx Lustre that reads from the S3 store. See [cache_storage_configuration](#cache_storage_configuration).\n* `code` - (Optional) Details of the custom code that you want to use inside a cluster when analyzing data. Consists of the S3 source bucket, location, object version, and the relative path from where the custom code is loaded into the cluster. See [code](#code).\n* `command_line_arguments` - (Optional) List of key-value pairs to make available inside the cluster.\n* `database` - (Optional) KX database that will be available for querying. Defined below.\n* `description` - (Optional) Description of the cluster.\n* `execution_role` - (Optional) An IAM role that defines a set of permissions associated with a cluster. These permissions are assumed when a cluster attempts to access another cluster.\n* `initialization_script` - (Optional) Path to Q program that will be run at launch of a cluster. This is a relative path within .zip file that contains the custom code, which will be loaded on the cluster. It must include the file name itself. For example, somedir/init.q.\n* `savedown_storage_configuration` - (Optional) Size and type of the temporary storage that is used to hold data during the savedown process. This parameter is required when you choose `type` as RDB. All the data written to this storage space is lost when the cluster node is restarted. See [savedown_storage_configuration](#savedown_storage_configuration).\n* `tags` - (Optional) Key-value mapping of resource tags. If configured with a provider [`default_tags` configuration block](/docs/providers/aws/index.html#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n\n### auto_scaling_configuration\n\nThe auto_scaling_configuration block supports the following arguments:\n\n* `auto_scaling_metric` - (Required) Metric your cluster will track in order to scale in and out. For example, CPU_UTILIZATION_PERCENTAGE is the average CPU usage across all nodes in a cluster.\n* `min_node_count` - (Required) Lowest number of nodes to scale. Must be at least 1 and less than the `max_node_count`. If nodes in cluster belong to multiple availability zones, then `min_node_count` must be at least 3.\n* `max_node_count` - (Required) Highest number of nodes to scale. Cannot be greater than 5\n* `metric_target` - (Required) Desired value of chosen `auto_scaling_metric`. When metric drops below this value, cluster will scale in. When metric goes above this value, cluster will scale out. Can be set between 0 and 100 percent.\n* `scale_in_cooldown_seconds` - (Required) Duration in seconds that FinSpace will wait after a scale in event before initiating another scaling event.\n* `scale_out_cooldown_seconds` - (Required) Duration in seconds that FinSpace will wait after a scale out event before initiating another scaling event.\n\n### capacity_configuration\n\nThe capacity_configuration block supports the following arguments:\n\n* `node_type` - (Required) Determines the hardware of the host computer used for your cluster instance. Each node type offers different memory and storage capabilities. Choose a node type based on the requirements of the application or software that you plan to run on your instance.\n  \n  You can only specify one of the following values:\n    * kx.s.large – The node type with a configuration of 12 GiB memory and 2 vCPUs.\n    * kx.s.xlarge – The node type with a configuration of 27 GiB memory and 4 vCPUs.\n    * kx.s.2xlarge – The node type with a configuration of 54 GiB memory and 8 vCPUs.\n    * kx.s.4xlarge – The node type with a configuration of 108 GiB memory and 16 vCPUs.\n    * kx.s.8xlarge – The node type with a configuration of 216 GiB memory and 32 vCPUs.\n    * kx.s.16xlarge – The node type with a configuration of 432 GiB memory and 64 vCPUs.\n    * kx.s.32xlarge – The node type with a configuration of 864 GiB memory and 128 vCPUs.\n* `node_count` - (Required) Number of instances running in a cluster. Must be at least 1 and at most 5.\n\n### cache_storage_configuration\n\nThe cache_storage_configuration block supports the following arguments:\n\n* `type` - (Required) Type of cache storage . The valid values are:\n    * CACHE_1000 - This type provides 1000 MB/s disk access throughput.\n    * CACHE_250 - This type provides 250 MB/s disk access throughput.\n    * CACHE_12 - This type provides 12 MB/s disk access throughput.\n* `size` - (Required) Size of cache in Gigabytes.\n\n### code\n\nThe code block supports the following arguments:\n\n* `s3_bucket` - (Required) Unique name for the S3 bucket.\n* `s3_key` - (Required) Full S3 path (excluding bucket) to the .zip file that contains the code to be loaded onto the cluster when it’s started.\n* `s3_object_version` - (Optional) Version of an S3 Object.\n\n### database\n\nThe database block supports the following arguments:\n\n* `database_name` - (Required) Name of the KX database.\n* `cache_configurations` - (Optional) Configuration details for the disk cache to increase performance reading from a KX database mounted to the cluster. See [cache_configurations](#cache_configurations).\n* `changeset_id` - (Optional) A unique identifier of the changeset that is associated with the cluster.\n\n#### cache_configurations\n\nThe cache_configuration block supports the following arguments:\n\n* `cache_type` - (Required) Type of disk cache.\n* `db_paths` - (Optional) Paths within the database to cache.\n\n### savedown_storage_configuration\n\nThe savedown_storage_configuration block supports the following arguments:\n\n* `type` - (Required) Type of writeable storage space for temporarily storing your savedown data. The valid values are:\n    * SDS01 - This type represents 3000 IOPS and io2 ebs volume type.\n* `size` - (Required) Size of temporary storage in gigabytes. Must be between 10 and 16000.\n\n### vpc_configuration\n\nThe vpc_configuration block supports the following arguments:\n\n* `vpc_id` - (Required) Identifier of the VPC endpoint\n* `security_group_ids` - (Required) Unique identifier of the VPC security group applied to the VPC endpoint ENI for the cluster.\n* `subnet_ids `- (Required) Identifier of the subnet that the Privatelink VPC endpoint uses to connect to the cluster.\n* `ip_address_type` - (Required) IP address type for cluster network configuration parameters. The following type is available: IP_V4 - IP address version 4.\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - Amazon Resource Name (ARN) identifier of the KX cluster.\n* `created_timestamp` - Timestamp at which the cluster is created in FinSpace. Value determined as epoch time in seconds. For example, the value for Monday, November 1, 2021 12:00:00 PM UTC is specified as 1635768000.\n* `id` - A comma-delimited string joining environment ID and cluster name.\n* `last_modified_timestamp` - Last timestamp at which the cluster was updated in FinSpace. Value determined as epoch time in seconds. For example, the value for Monday, November 1, 2021 12:00:00 PM UTC is specified as 1635768000.\n* `tags_all` - Map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](/docs/providers/aws/index.html#default_tags-configuration-block).\n\n## Timeouts\n\n[Configuration options](https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts):\n\n* `create` - (Default `45m`)\n* `update` - (Default `2m`)\n* `delete` - (Default `60m`)\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import an AWS FinSpace Kx Cluster using the `id` (environment ID and cluster name, comma-delimited). For example:\n\n```terraform\nimport {\n  to = aws_finspace_kx_cluster.example\n  id = \"n3ceo7wqxoxcti5tujqwzs,my-tf-kx-cluster\"\n}\n```\n\nUsing `terraform import`, import an AWS FinSpace Kx Cluster using the `id` (environment ID and cluster name, comma-delimited). For example:\n\n```console\n% terraform import aws_finspace_kx_cluster.example n3ceo7wqxoxcti5tujqwzs,my-tf-kx-cluster\n```\n",
      "language": "hcl",
      "path": "website/docs/r/finspace_kx_cluster.html.markdown",
      "slug": "finspace_kx_cluster",
      "subcategory": "FinSpace",
      "title": "finspace_kx_cluster",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3255229"
    }
  }
}