{
  "data": {
    "type": "provider-docs",
    "id": "3198562",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"Lambda\"\nlayout: \"aws\"\npage_title: \"AWS: aws_lambda_function\"\ndescription: |-\n  Provides a Lambda Function resource. Lambda allows you to trigger execution of code in response to events in AWS, enabling serverless backend solutions. The Lambda Function itself includes source code and runtime configuration.\n---\n\n# Resource: aws_lambda_function\n\nProvides a Lambda Function resource. Lambda allows you to trigger execution of code in response to events in AWS, enabling serverless backend solutions. The Lambda Function itself includes source code and runtime configuration.\n\nFor information about Lambda and how to use it, see [What is AWS Lambda?][1]\n\nFor a detailed example of setting up Lambda and API Gateway, see [Serverless Applications with AWS Lambda and API Gateway.][11]\n\n~> **NOTE:** Due to [AWS Lambda improved VPC networking changes that began deploying in September 2019](https://aws.amazon.com/blogs/compute/announcing-improved-vpc-networking-for-aws-lambda-functions/), EC2 subnets and security groups associated with Lambda Functions can take up to 45 minutes to successfully delete. Terraform AWS Provider version 2.31.0 and later automatically handles this increased timeout, however prior versions require setting the customizable deletion timeouts of those Terraform resources to 45 minutes (`delete = \"45m\"`). AWS and HashiCorp are working together to reduce the amount of time required for resource deletion and updates can be tracked in this [GitHub issue](https://github.com/hashicorp/terraform-provider-aws/issues/10329).\n\n~> **NOTE:** If you get a `KMSAccessDeniedException: Lambda was unable to decrypt the environment variables because KMS access was denied` error when invoking an [`aws_lambda_function`](/docs/providers/aws/r/lambda_function.html) with environment variables, the IAM role associated with the function may have been deleted and recreated _after_ the function was created. You can fix the problem two ways: 1) updating the function's role to another role and then updating it back again to the recreated role, or 2) by using Terraform to `taint` the function and `apply` your configuration again to recreate the function. (When you create a function, Lambda grants permissions on the KMS key to the function's IAM role. If the IAM role is recreated, the grant is no longer valid. Changing the function's role or recreating the function causes Lambda to update the grant.)\n\n-> To give an external source (like an EventBridge Rule, SNS, or S3) permission to access the Lambda function, use the [`aws_lambda_permission`](lambda_permission.html) resource. See [Lambda Permission Model][4] for more details. On the other hand, the `role` argument of this resource is the function's execution role for identity and access to AWS services and resources.\n\n## Example Usage\n\n### Basic Example\n\n```terraform\ndata \"aws_iam_policy_document\" \"assume_role\" {\n  statement {\n    effect = \"Allow\"\n\n    principals {\n      type        = \"Service\"\n      identifiers = [\"lambda.amazonaws.com\"]\n    }\n\n    actions = [\"sts:AssumeRole\"]\n  }\n}\n\nresource \"aws_iam_role\" \"iam_for_lambda\" {\n  name               = \"iam_for_lambda\"\n  assume_role_policy = data.aws_iam_policy_document.assume_role.json\n}\n\ndata \"archive_file\" \"lambda\" {\n  type        = \"zip\"\n  source_file = \"lambda.js\"\n  output_path = \"lambda_function_payload.zip\"\n}\n\nresource \"aws_lambda_function\" \"test_lambda\" {\n  # If the file is not in the current working directory you will need to include a\n  # path.module in the filename.\n  filename      = \"lambda_function_payload.zip\"\n  function_name = \"lambda_function_name\"\n  role          = aws_iam_role.iam_for_lambda.arn\n  handler       = \"index.test\"\n\n  source_code_hash = data.archive_file.lambda.output_base64sha256\n\n  runtime = \"nodejs18.x\"\n\n  environment {\n    variables = {\n      foo = \"bar\"\n    }\n  }\n}\n```\n\n### Lambda Layers\n\n~> **NOTE:** The `aws_lambda_layer_version` attribute values for `arn` and `layer_arn` were swapped in version 2.0.0 of the Terraform AWS Provider. For version 1.x, use `layer_arn` references. For version 2.x, use `arn` references.\n\n```terraform\nresource \"aws_lambda_layer_version\" \"example\" {\n  # ... other configuration ...\n}\n\nresource \"aws_lambda_function\" \"example\" {\n  # ... other configuration ...\n  layers = [aws_lambda_layer_version.example.arn]\n}\n```\n\n### Lambda Ephemeral Storage\n\nLambda Function Ephemeral Storage(`/tmp`) allows you to configure the storage upto `10` GB. The default value set to `512` MB.\n\n```terraform\ndata \"aws_iam_policy_document\" \"assume_role\" {\n  statement {\n    effect = \"Allow\"\n\n    principals {\n      type        = \"Service\"\n      identifiers = [\"lambda.amazonaws.com\"]\n    }\n\n    actions = [\"sts:AssumeRole\"]\n  }\n}\n\nresource \"aws_iam_role\" \"iam_for_lambda\" {\n  name               = \"iam_for_lambda\"\n  assume_role_policy = data.aws_iam_policy_document.assume_role.json\n}\n\nresource \"aws_lambda_function\" \"test_lambda\" {\n  filename      = \"lambda_function_payload.zip\"\n  function_name = \"lambda_function_name\"\n  role          = aws_iam_role.iam_for_lambda.arn\n  handler       = \"index.test\"\n  runtime       = \"nodejs18.x\"\n\n  ephemeral_storage {\n    size = 10240 # Min 512 MB and the Max 10240 MB\n  }\n}\n```\n\n### Lambda File Systems\n\nLambda File Systems allow you to connect an Amazon Elastic File System (EFS) file system to a Lambda function to share data across function invocations, access existing data including large files, and save function state.\n\n```terraform\n# A lambda function connected to an EFS file system\nresource \"aws_lambda_function\" \"example\" {\n  # ... other configuration ...\n\n  file_system_config {\n    # EFS file system access point ARN\n    arn = aws_efs_access_point.access_point_for_lambda.arn\n\n    # Local mount path inside the lambda function. Must start with '/mnt/'.\n    local_mount_path = \"/mnt/efs\"\n  }\n\n  vpc_config {\n    # Every subnet should be able to reach an EFS mount target in the same Availability Zone. Cross-AZ mounts are not permitted.\n    subnet_ids         = [aws_subnet.subnet_for_lambda.id]\n    security_group_ids = [aws_security_group.sg_for_lambda.id]\n  }\n\n  # Explicitly declare dependency on EFS mount target.\n  # When creating or updating Lambda functions, mount target must be in 'available' lifecycle state.\n  depends_on = [aws_efs_mount_target.alpha]\n}\n\n# EFS file system\nresource \"aws_efs_file_system\" \"efs_for_lambda\" {\n  tags = {\n    Name = \"efs_for_lambda\"\n  }\n}\n\n# Mount target connects the file system to the subnet\nresource \"aws_efs_mount_target\" \"alpha\" {\n  file_system_id  = aws_efs_file_system.efs_for_lambda.id\n  subnet_id       = aws_subnet.subnet_for_lambda.id\n  security_groups = [aws_security_group.sg_for_lambda.id]\n}\n\n# EFS access point used by lambda file system\nresource \"aws_efs_access_point\" \"access_point_for_lambda\" {\n  file_system_id = aws_efs_file_system.efs_for_lambda.id\n\n  root_directory {\n    path = \"/lambda\"\n    creation_info {\n      owner_gid   = 1000\n      owner_uid   = 1000\n      permissions = \"777\"\n    }\n  }\n\n  posix_user {\n    gid = 1000\n    uid = 1000\n  }\n}\n```\n\n### Lambda retries\n\nLambda Functions allow you to configure error handling for asynchronous invocation. The settings that it supports are `Maximum age of event` and `Retry attempts` as stated in [Lambda documentation for Configuring error handling for asynchronous invocation](https://docs.aws.amazon.com/lambda/latest/dg/invocation-async.html#invocation-async-errors). To configure these settings, refer to the [aws_lambda_function_event_invoke_config resource](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/lambda_function_event_invoke_config).\n\n## CloudWatch Logging and Permissions\n\nFor more information about CloudWatch Logs for Lambda, see the [Lambda User Guide](https://docs.aws.amazon.com/lambda/latest/dg/monitoring-functions-logs.html).\n\n```terraform\nvariable \"lambda_function_name\" {\n  default = \"lambda_function_name\"\n}\n\nresource \"aws_lambda_function\" \"test_lambda\" {\n  function_name = var.lambda_function_name\n\n  # ... other configuration ...\n  depends_on = [\n    aws_iam_role_policy_attachment.lambda_logs,\n    aws_cloudwatch_log_group.example,\n  ]\n}\n\n# This is to optionally manage the CloudWatch Log Group for the Lambda Function.\n# If skipping this resource configuration, also add \"logs:CreateLogGroup\" to the IAM policy below.\nresource \"aws_cloudwatch_log_group\" \"example\" {\n  name              = \"/aws/lambda/${var.lambda_function_name}\"\n  retention_in_days = 14\n}\n\n# See also the following AWS managed policy: AWSLambdaBasicExecutionRole\ndata \"aws_iam_policy_document\" \"lambda_logging\" {\n  statement {\n    effect = \"Allow\"\n\n    actions = [\n      \"logs:CreateLogGroup\",\n      \"logs:CreateLogStream\",\n      \"logs:PutLogEvents\",\n    ]\n\n    resources = [\"arn:aws:logs:*:*:*\"]\n  }\n}\n\nresource \"aws_iam_policy\" \"lambda_logging\" {\n  name        = \"lambda_logging\"\n  path        = \"/\"\n  description = \"IAM policy for logging from a lambda\"\n  policy      = data.aws_iam_policy_document.lambda_logging.json\n}\n\nresource \"aws_iam_role_policy_attachment\" \"lambda_logs\" {\n  role       = aws_iam_role.iam_for_lambda.name\n  policy_arn = aws_iam_policy.lambda_logging.arn\n}\n```\n\n## Specifying the Deployment Package\n\nAWS Lambda expects source code to be provided as a deployment package whose structure varies depending on which `runtime` is in use. See [Runtimes][6] for the valid values of `runtime`. The expected structure of the deployment package can be found in [the AWS Lambda documentation for each runtime][8].\n\nOnce you have created your deployment package you can specify it either directly as a local file (using the `filename` argument) or indirectly via Amazon S3 (using the `s3_bucket`, `s3_key` and `s3_object_version` arguments). When providing the deployment package via S3 it may be useful to use [the `aws_s3_object` resource](s3_object.html) to upload it.\n\nFor larger deployment packages it is recommended by Amazon to upload via S3, since the S3 API has better support for uploading large files efficiently.\n\n## Argument Reference\n\nThe following arguments are required:\n\n* `function_name` - (Required) Unique name for your Lambda Function.\n* `role` - (Required) Amazon Resource Name (ARN) of the function's execution role. The role provides the function's identity and access to AWS services and resources.\n\nThe following arguments are optional:\n\n* `architectures` - (Optional) Instruction set architecture for your Lambda function. Valid values are `[\"x86_64\"]` and `[\"arm64\"]`. Default is `[\"x86_64\"]`. Removing this attribute, function's architecture stay the same.\n* `code_signing_config_arn` - (Optional) To enable code signing for this function, specify the ARN of a code-signing configuration. A code-signing configuration includes a set of signing profiles, which define the trusted publishers for this function.\n* `dead_letter_config` - (Optional) Configuration block. Detailed below.\n* `description` - (Optional) Description of what your Lambda Function does.\n* `environment` - (Optional) Configuration block. Detailed below.\n* `ephemeral_storage` - (Optional) The amount of Ephemeral storage(`/tmp`) to allocate for the Lambda Function in MB. This parameter is used to expand the total amount of Ephemeral storage available, beyond the default amount of `512`MB. Detailed below.\n* `file_system_config` - (Optional) Configuration block. Detailed below.\n* `filename` - (Optional) Path to the function's deployment package within the local filesystem. Exactly one of `filename`, `image_uri`, or `s3_bucket` must be specified.\n* `handler` - (Optional) Function [entrypoint][3] in your code.\n* `image_config` - (Optional) Configuration block. Detailed below.\n* `image_uri` - (Optional) ECR image URI containing the function's deployment package. Exactly one of `filename`, `image_uri`,  or `s3_bucket` must be specified.\n* `kms_key_arn` - (Optional) Amazon Resource Name (ARN) of the AWS Key Management Service (KMS) key that is used to encrypt environment variables. If this configuration is not provided when environment variables are in use, AWS Lambda uses a default service key. If this configuration is provided when environment variables are not in use, the AWS Lambda API does not save this configuration and Terraform will show a perpetual difference of adding the key. To fix the perpetual difference, remove this configuration.\n* `layers` - (Optional) List of Lambda Layer Version ARNs (maximum of 5) to attach to your Lambda Function. See [Lambda Layers][10]\n* `memory_size` - (Optional) Amount of memory in MB your Lambda Function can use at runtime. Defaults to `128`. See [Limits][5]\n* `package_type` - (Optional) Lambda deployment package type. Valid values are `Zip` and `Image`. Defaults to `Zip`.\n* `publish` - (Optional) Whether to publish creation/change as new Lambda Function Version. Defaults to `false`.\n* `reserved_concurrent_executions` - (Optional) Amount of reserved concurrent executions for this lambda function. A value of `0` disables lambda from being triggered and `-1` removes any concurrency limitations. Defaults to Unreserved Concurrency Limits `-1`. See [Managing Concurrency][9]\n* `replace_security_groups_on_destroy` - (Optional, **Deprecated**) **AWS no longer supports this operation. This attribute now has no effect and will be removed in a future major version.** Whether to replace the security groups on associated lambda network interfaces upon destruction. Removing these security groups from orphaned network interfaces can speed up security group deletion times by avoiding a dependency on AWS's internal cleanup operations. By default, the ENI security groups will be replaced with the `default` security group in the function's VPC. Set the `replacement_security_group_ids` attribute to use a custom list of security groups for replacement.\n* `replacement_security_group_ids` - (Optional, **Deprecated**) List of security group IDs to assign to orphaned Lambda function network interfaces upon destruction. `replace_security_groups_on_destroy` must be set to `true` to use this attribute.\n* `runtime` - (Optional) Identifier of the function's runtime. See [Runtimes][6] for valid values.\n* `s3_bucket` - (Optional) S3 bucket location containing the function's deployment package. This bucket must reside in the same AWS region where you are creating the Lambda function. Exactly one of `filename`, `image_uri`, or `s3_bucket` must be specified. When `s3_bucket` is set, `s3_key` is required.\n* `s3_key` - (Optional) S3 key of an object containing the function's deployment package. When `s3_bucket` is set, `s3_key` is required.\n* `s3_object_version` - (Optional) Object version containing the function's deployment package. Conflicts with `filename` and `image_uri`.\n* `skip_destroy` - (Optional) Set to true if you do not wish the function to be deleted at destroy time, and instead just remove the function from the Terraform state.\n* `source_code_hash` - (Optional) Used to trigger updates. Must be set to a base64-encoded SHA256 hash of the package file specified with either `filename` or `s3_key`. The usual way to set this is `filebase64sha256(\"file.zip\")` (Terraform 0.11.12 and later) or `base64sha256(file(\"file.zip\"))` (Terraform 0.11.11 and earlier), where \"file.zip\" is the local filename of the lambda function source archive.\n* `snap_start` - (Optional) Snap start settings block. Detailed below.\n* `tags` - (Optional) Map of tags to assign to the object. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n* `timeout` - (Optional) Amount of time your Lambda Function has to run in seconds. Defaults to `3`. See [Limits][5].\n* `tracing_config` - (Optional) Configuration block. Detailed below.\n* `vpc_config` - (Optional) Configuration block. Detailed below.\n\n### dead_letter_config\n\nDead letter queue configuration that specifies the queue or topic where Lambda sends asynchronous events when they fail processing. For more information, see [Dead Letter Queues](https://docs.aws.amazon.com/lambda/latest/dg/invocation-async.html#dlq).\n\n* `target_arn` - (Required) ARN of an SNS topic or SQS queue to notify when an invocation fails. If this option is used, the function's IAM role must be granted suitable access to write to the target object, which means allowing either the `sns:Publish` or `sqs:SendMessage` action on this ARN, depending on which service is targeted.\n\n### environment\n\n* `variables` - (Optional) Map of environment variables that are accessible from the function code during execution. If provided at least one key must be present.\n\n### ephemeral_storage\n\n* `size` - (Required) The size of the Lambda function Ephemeral storage(`/tmp`) represented in MB. The minimum supported `ephemeral_storage` value defaults to `512`MB and the maximum supported value is `10240`MB.\n\n### file_system_config\n\nConnection settings for an EFS file system. Before creating or updating Lambda functions with `file_system_config`, EFS mount targets must be in available lifecycle state. Use `depends_on` to explicitly declare this dependency. See [Using Amazon EFS with Lambda][12].\n\n* `arn` - (Required) Amazon Resource Name (ARN) of the Amazon EFS Access Point that provides access to the file system.\n* `local_mount_path` - (Required) Path where the function can access the file system, starting with /mnt/.\n\n### image_config\n\nContainer image configuration values that override the values in the container image Dockerfile.\n\n* `command` - (Optional) Parameters that you want to pass in with `entry_point`.\n* `entry_point` - (Optional) Entry point to your application, which is typically the location of the runtime executable.\n* `working_directory` - (Optional) Working directory.\n\n### snap_start\n\nSnap start settings for low-latency startups. This feature is currently only supported for `java11` and `java17` runtimes. Remove this block to delete the associated settings (rather than setting `apply_on = \"None\"`).\n\n* `apply_on` - (Required) Conditions where snap start is enabled. Valid values are `PublishedVersions`.\n\n### tracing_config\n\n* `mode` - (Required) Whether to sample and trace a subset of incoming requests with AWS X-Ray. Valid values are `PassThrough` and `Active`. If `PassThrough`, Lambda will only trace the request from an upstream service if it contains a tracing header with \"sampled=1\". If `Active`, Lambda will respect any tracing header it receives from an upstream service. If no tracing header is received, Lambda will call X-Ray for a tracing decision.\n\n### vpc_config\n\nFor network connectivity to AWS resources in a VPC, specify a list of security groups and subnets in the VPC. When you connect a function to a VPC, it can only access resources and the internet through that VPC. See [VPC Settings][7].\n\n~> **NOTE:** If both `subnet_ids` and `security_group_ids` are empty then `vpc_config` is considered to be empty or unset.\n\n* `security_group_ids` - (Required) List of security group IDs associated with the Lambda function.\n* `subnet_ids` - (Required) List of subnet IDs associated with the Lambda function.\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - Amazon Resource Name (ARN) identifying your Lambda Function.\n* `invoke_arn` - ARN to be used for invoking Lambda Function from API Gateway - to be used in [`aws_api_gateway_integration`](/docs/providers/aws/r/api_gateway_integration.html)'s `uri`.\n* `last_modified` - Date this resource was last modified.\n* `qualified_arn` - ARN identifying your Lambda Function Version (if versioning is enabled via `publish = true`).\n* `qualified_invoke_arn` - Qualified ARN (ARN with lambda version number) to be used for invoking Lambda Function from API Gateway - to be used in [`aws_api_gateway_integration`](/docs/providers/aws/r/api_gateway_integration.html)'s `uri`.\n* `signing_job_arn` - ARN of the signing job.\n* `signing_profile_version_arn` - ARN of the signing profile version.\n* `snap_start.optimization_status` - Optimization status of the snap start configuration. Valid values are `On` and `Off`.\n* `source_code_size` - Size in bytes of the function .zip file.\n* `tags_all` - A map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block).\n* `version` - Latest published version of your Lambda Function.\n* `vpc_config.vpc_id` - ID of the VPC.\n\n[1]: https://docs.aws.amazon.com/lambda/latest/dg/welcome.html\n[3]: https://docs.aws.amazon.com/lambda/latest/dg/walkthrough-custom-events-create-test-function.html\n[4]: https://docs.aws.amazon.com/lambda/latest/dg/intro-permission-model.html\n[5]: https://docs.aws.amazon.com/lambda/latest/dg/limits.html\n[6]: https://docs.aws.amazon.com/lambda/latest/dg/API_CreateFunction.html#SSS-CreateFunction-request-Runtime\n[7]: https://docs.aws.amazon.com/lambda/latest/dg/configuration-vpc.html\n[8]: https://docs.aws.amazon.com/lambda/latest/dg/deployment-package-v2.html\n[9]: https://docs.aws.amazon.com/lambda/latest/dg/concurrent-executions.html\n[10]: https://docs.aws.amazon.com/lambda/latest/dg/configuration-layers.html\n[11]: https://learn.hashicorp.com/terraform/aws/lambda-api-gateway\n[12]: https://docs.aws.amazon.com/lambda/latest/dg/services-efs.html\n\n## Timeouts\n\n[Configuration options](https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts):\n\n* `create` - (Default `10m`)\n* `update` - (Default `10m`)\n* `delete` - (Default `10m`)\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import Lambda Functions using the `function_name`. For example:\n\n```terraform\nimport {\n  to = aws_lambda_function.test_lambda\n  id = \"my_test_lambda_function\"\n}\n```\n\nUsing `terraform import`, import Lambda Functions using the `function_name`. For example:\n\n```console\n% terraform import aws_lambda_function.test_lambda my_test_lambda_function\n```\n",
      "language": "hcl",
      "path": "website/docs/r/lambda_function.html.markdown",
      "slug": "lambda_function",
      "subcategory": "Lambda",
      "title": "lambda_function",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3198562"
    }
  }
}