{
  "data": {
    "type": "provider-docs",
    "id": "3197493",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"RDS (Relational Database)\"\nlayout: \"aws\"\npage_title: \"AWS: aws_db_instance\"\ndescription: |-\n  Get information on an RDS Database Instance.\n---\n\n# Data Source: aws_db_instance\n\nUse this data source to get information about an RDS instance\n\n## Example Usage\n\n```terraform\ndata \"aws_db_instance\" \"database\" {\n  db_instance_identifier = \"my-test-database\"\n}\n```\n\n## Argument Reference\n\nThis data source supports the following arguments:\n\n* `db_instance_identifier` - (Optional) Name of the RDS instance.\n* `tags` - (Optional) Map of tags, each pair of which must exactly match a pair on the desired instance.\n\n## Attribute Reference\n\n~> **NOTE:** The `port` field may be empty while an Aurora cluster is still in the process of being created. This can occur if the cluster was initiated with the [AWS CLI `create-db-cluster`](https://docs.aws.amazon.com/cli/latest/reference/rds/create-db-cluster.html) command, but no DB instance has yet been added to it.\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `address` - Hostname of the RDS instance. See also `endpoint` and `port`.\n* `allocated_storage` - Allocated storage size specified in gigabytes.\n* `auto_minor_version_upgrade` - Indicates that minor version patches are applied automatically.\n* `availability_zone` - Name of the Availability Zone the DB instance is located in.\n* `backup_retention_period` - Specifies the number of days for which automatic DB snapshots are retained.\n* `db_cluster_identifier` - If the DB instance is a member of a DB cluster, contains the name of the DB cluster that the DB instance is a member of.\n* `db_instance_arn` - ARN for the DB instance.\n* `db_instance_class` - Contains the name of the compute and memory capacity class of the DB instance.\n* `db_name` - Contains the name of the initial database of this instance that was provided at create time, if one was specified when the DB instance was created. This same name is returned for the life of the DB instance.\n* `db_parameter_groups` - Provides the list of DB parameter groups applied to this DB instance.\n* `db_subnet_group` - Name of the subnet group associated with the DB instance.\n* `db_instance_port` - Port that the DB instance listens on.\n* `enabled_cloudwatch_logs_exports` - List of log types to export to cloudwatch.\n* `endpoint` - Connection endpoint in `address:port` format.\n* `engine` - Provides the name of the database engine to be used for this DB instance.\n* `engine_version` - Database engine version.\n* `hosted_zone_id` - Canonical hosted zone ID of the DB instance (to be used in a Route 53 Alias record).\n* `iops` - Provisioned IOPS (I/O operations per second) value.\n* `kms_key_id` - If StorageEncrypted is true, the KMS key identifier for the encrypted DB instance.\n* `license_model` - License model information for this DB instance.\n* `master_username` - Contains the master username for the DB instance.\n* `master_user_secret` - Provides the master user secret. Only available when `manage_master_user_password` is set to true. [Documented below](#master_user_secret).\n* `max_allocated_storage` - The upper limit to which Amazon RDS can automatically scale the storage of the DB instance.\n* `monitoring_interval` - Interval, in seconds, between points when Enhanced Monitoring metrics are collected for the DB instance.\n* `monitoring_role_arn` - ARN for the IAM role that permits RDS to send Enhanced Monitoring metrics to CloudWatch Logs.\n* `multi_az` - If the DB instance is a Multi-AZ deployment.\n* `network_type` - Network type of the DB instance.\n* `option_group_memberships` - Provides the list of option group memberships for this DB instance.\n* `port` - Database endpoint port, primarily used by an Aurora DB cluster. For a conventional RDS DB instance, the `db_instance_port` is typically the preferred choice.\n* `preferred_backup_window` - Specifies the daily time range during which automated backups are created.\n* `preferred_maintenance_window` -  Specifies the weekly time range during which system maintenance can occur in UTC.\n* `publicly_accessible` - Accessibility options for the DB instance.\n* `resource_id` - RDS Resource ID of this instance.\n* `storage_encrypted` - Whether the DB instance is encrypted.\n* `storage_throughput` - Storage throughput value for the DB instance.\n* `storage_type` - Storage type associated with DB instance.\n* `timezone` - Time zone of the DB instance.\n* `vpc_security_groups` - Provides a list of VPC security group elements that the DB instance belongs to.\n* `replicate_source_db` - Identifier of the source DB that this is a replica of.\n* `ca_cert_identifier` - Identifier of the CA certificate for the DB instance.\n\n### master_user_secret\n\nThe `master_user_secret` configuration block supports the following attributes:\n\n* `kms_key_id` - The Amazon Web Services KMS key identifier that is used to encrypt the secret.\n* `secret_arn` - The Amazon Resource Name (ARN) of the secret.\n* `secret_status` - The status of the secret. Valid Values: `creating` | `active` | `rotating` | `impaired`.\n",
      "language": "hcl",
      "path": "website/docs/d/db_instance.html.markdown",
      "slug": "db_instance",
      "subcategory": "RDS (Relational Database)",
      "title": "db_instance",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3197493"
    }
  }
}