{
  "data": {
    "type": "provider-docs",
    "id": "3197916",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"EC2 (Elastic Compute Cloud)\"\nlayout: \"aws\"\npage_title: \"AWS: aws_ami_from_instance\"\ndescription: |-\n  Creates an Amazon Machine Image (AMI) from an EBS-backed EC2 instance\n---\n\n# Resource: aws_ami_from_instance\n\nThe \"AMI from instance\" resource allows the creation of an Amazon Machine\nImage (AMI) modelled after an existing EBS-backed EC2 instance.\n\nThe created AMI will refer to implicitly-created snapshots of the instance's\nEBS volumes and mimick its assigned block device configuration at the time\nthe resource is created.\n\nThis resource is best applied to an instance that is stopped when this instance\nis created, so that the contents of the created image are predictable. When\napplied to an instance that is running, *the instance will be stopped before taking\nthe snapshots and then started back up again*, resulting in a period of\ndowntime.\n\nNote that the source instance is inspected only at the initial creation of this\nresource. Ongoing updates to the referenced instance will not be propagated into\nthe generated AMI. Users may taint or otherwise recreate the resource in order\nto produce a fresh snapshot.\n\n## Example Usage\n\n```terraform\nresource \"aws_ami_from_instance\" \"example\" {\n  name               = \"terraform-example\"\n  source_instance_id = \"i-xxxxxxxx\"\n}\n```\n\n## Argument Reference\n\nThis resource supports the following arguments:\n\n* `name` - (Required) Region-unique name for the AMI.\n* `source_instance_id` - (Required) ID of the instance to use as the basis of the AMI.\n* `snapshot_without_reboot` - (Optional) Boolean that overrides the behavior of stopping\n  the instance before snapshotting. This is risky since it may cause a snapshot of an\n  inconsistent filesystem state, but can be used to avoid downtime if the user otherwise\n  guarantees that no filesystem writes will be underway at the time of snapshot.\n* `tags` - (Optional) Map of tags to assign to the resource. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n\n## Timeouts\n\n[Configuration options](https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts):\n\n* `create` - (Default `40m`)\n* `update` - (Default `40m`)\n* `delete` - (Default `90m`)\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - ARN of the AMI.\n* `id` - ID of the created AMI.\n\nThis resource also exports a full set of attributes corresponding to the arguments of the\n[`aws_ami`](/docs/providers/aws/r/ami.html) resource, allowing the properties of the created AMI to be used elsewhere in the\nconfiguration.\n",
      "language": "hcl",
      "path": "website/docs/r/ami_from_instance.html.markdown",
      "slug": "ami_from_instance",
      "subcategory": "EC2 (Elastic Compute Cloud)",
      "title": "ami_from_instance",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3197916"
    }
  }
}