{
  "data": {
    "type": "provider-docs",
    "id": "3198896",
    "attributes": {
      "category": "resources",
      "content": "---\nsubcategory: \"SageMaker\"\nlayout: \"aws\"\npage_title: \"AWS: aws_sagemaker_data_quality_job_definition\"\ndescription: |-\n  Provides a SageMaker Data Quality Job Definition resource.\n---\n\n# Resource: aws_sagemaker_data_quality_job_definition\n\nProvides a SageMaker data quality job definition resource.\n\n## Example Usage\n\nBasic usage:\n\n```terraform\nresource \"aws_sagemaker_data_quality_job_definition\" \"test\" {\n  name = \"my-data-quality-job-definition\"\n\n  data_quality_app_specification {\n    image_uri = data.aws_sagemaker_prebuilt_ecr_image.monitor.registry_path\n  }\n  data_quality_job_input {\n    endpoint_input {\n      endpoint_name = aws_sagemaker_endpoint.my_endpoint.name\n    }\n  }\n  data_quality_job_output_config {\n    monitoring_outputs {\n      s3_output {\n        s3_uri = \"https://${aws_s3_bucket.my_bucket.bucket_regional_domain_name}/output\"\n      }\n    }\n  }\n  job_resources {\n    cluster_config {\n      instance_count    = 1\n      instance_type     = \"ml.t3.medium\"\n      volume_size_in_gb = 20\n    }\n  }\n  role_arn = aws_iam_role.my_role.arn\n}\n```\n\n## Argument Reference\n\nThis resource supports the following arguments:\n\n* `data_quality_app_specification` - (Required) Specifies the container that runs the monitoring job. Fields are documented below.\n* `data_quality_baseline_config` - (Optional) Configures the constraints and baselines for the monitoring job. Fields are documented below.\n* `data_quality_job_input` - (Required) A list of inputs for the monitoring job. Fields are documented below.\n* `data_quality_job_output_config` - (Required) The output configuration for monitoring jobs. Fields are documented below.\n* `job_resources` - (Required) Identifies the resources to deploy for a monitoring job. Fields are documented below.\n* `name` - (Optional) The name of the data quality job definition. If omitted, Terraform will assign a random, unique name.\n* `network_config` - (Optional) Specifies networking configuration for the monitoring job. Fields are documented below.\n* `role_arn` - (Required) The Amazon Resource Name (ARN) of an IAM role that Amazon SageMaker can assume to perform tasks on your behalf.\n* `stopping_condition` - (Optional) A time limit for how long the monitoring job is allowed to run before stopping. Fields are documented below.\n* `tags` - (Optional) A mapping of tags to assign to the resource. If configured with a provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block) present, tags with matching keys will overwrite those defined at the provider-level.\n\n### data_quality_app_specification\n\n* `environment` - (Optional) Sets the environment variables in the container that the monitoring job runs. A list of key value pairs.\n* `image_uri` - (Required) The container image that the data quality monitoring job runs.\n* `post_analytics_processor_source_uri` - (Optional) An Amazon S3 URI to a script that is called after analysis has been performed. Applicable only for the built-in (first party) containers.\n* `record_preprocessor_source_uri` - (Optional) An Amazon S3 URI to a script that is called per row prior to running analysis. It can base64 decode the payload and convert it into a flatted json so that the built-in container can use the converted data. Applicable only for the built-in (first party) containers.\n\n### data_quality_baseline_config\n\n* `constraints_resource` - (Optional) The constraints resource for a monitoring job. Fields are documented below.\n* `statistics_resource` - (Optional) The statistics resource for a monitoring job. Fields are documented below.\n\n#### constraints_resource\n\n* `s3_uri` - (Optional) The Amazon S3 URI for the constraints resource.\n\n#### statistics_resource\n\n* `s3_uri` - (Optional) The Amazon S3 URI for the statistics resource.\n\n### data_quality_job_input\n\n* `batch_transform_input` - (Optional) Input object for the batch transform job. Fields are documented below.\n* `endpoint_input` - (Optional) Input object for the endpoint. Fields are documented below.\n\n#### batch_transform_input\n\n* `data_captured_destination_s3_uri` - (Required) The Amazon S3 location being used to capture the data.\n* `dataset_format` - (Required) The dataset format for your batch transform job. Fields are documented below.\n* `local_path` - (Optional) Path to the filesystem where the batch transform data is available to the container. Defaults to `/opt/ml/processing/input`.\n* `s3_data_distribution_type` - (Optional) Whether input data distributed in Amazon S3 is fully replicated or sharded by an S3 key. Defaults to `FullyReplicated`. Valid values are `FullyReplicated` or `ShardedByS3Key`\n* `s3_input_mode` - (Optional) Whether the `Pipe` or `File` is used as the input mode for transferring data for the monitoring job. `Pipe` mode is recommended for large datasets. `File` mode is useful for small files that fit in memory. Defaults to `File`.  Valid values are `Pipe` or `File`\n\n##### dataset_format\n\n* `csv` - (Optional) The CSV dataset used in the monitoring job. Fields are documented below.\n* `json` - (Optional) The JSON dataset used in the monitoring job. Fields are documented below.\n\n###### csv\n\n* `header` - (Optional) Indicates if the CSV data has a header.\n\n###### json\n\n* `line` - (Optional) Indicates if the file should be read as a json object per line.\n\n#### endpoint_input\n\n* `endpoint_name` - (Required) An endpoint in customer's account which has `data_capture_config` enabled.\n* `local_path` - (Optional) Path to the filesystem where the endpoint data is available to the container. Defaults to `/opt/ml/processing/input`.\n* `s3_data_distribution_type` - (Optional) Whether input data distributed in Amazon S3 is fully replicated or sharded by an S3 key. Defaults to `FullyReplicated`. Valid values are `FullyReplicated` or `ShardedByS3Key`\n* `s3_input_mode` - (Optional) Whether the `Pipe` or `File` is used as the input mode for transferring data for the monitoring job. `Pipe` mode is recommended for large datasets. `File` mode is useful for small files that fit in memory. Defaults to `File`.  Valid values are `Pipe` or `File`\n\n### data_quality_job_output_config\n\n* `kms_key_id` - (Optional) The AWS Key Management Service (AWS KMS) key that Amazon SageMaker uses to encrypt the model artifacts at rest using Amazon S3 server-side encryption.\n* `monitoring_outputs` - (Required) Monitoring outputs for monitoring jobs. This is where the output of the periodic monitoring jobs is uploaded. Fields are documented below.\n\n#### monitoring_outputs\n\n* `s3_output` - (Required) The Amazon S3 storage location where the results of a monitoring job are saved. Fields are documented below.\n\n##### s3_output\n\n* `local_path` - (Optional) The local path to the Amazon S3 storage location where Amazon SageMaker saves the results of a monitoring job. LocalPath is an absolute path for the output data. Defaults to `/opt/ml/processing/output`.\n* `s3_upload_mode` - (Optional) Whether to upload the results of the monitoring job continuously or after the job completes. Valid values are `Continuous` or `EndOfJob`\n* `s3_uri` - (Required) A URI that identifies the Amazon S3 storage location where Amazon SageMaker saves the results of a monitoring job.\n\n### job_resources\n\n* `cluster_config` - (Required) The configuration for the cluster resources used to run the processing job. Fields are documented below.\n\n#### cluster_config\n\n* `instance_count` - (Required) The number of ML compute instances to use in the model monitoring job. For distributed processing jobs, specify a value greater than 1.\n* `instance_type` - (Required) The ML compute instance type for the processing job.\n* `volume_kms_key_id` - (Optional) The AWS Key Management Service (AWS KMS) key that Amazon SageMaker uses to encrypt data on the storage volume attached to the ML compute instance(s) that run the model monitoring job.\n* `volume_size_in_gb` - (Required) The size of the ML storage volume, in gigabytes, that you want to provision. You must specify sufficient ML storage for your scenario.\n\n### network_config\n\n* `enable_inter_container_traffic_encryption` - (Optional) Whether to encrypt all communications between the instances used for the monitoring jobs. Choose `true` to encrypt communications. Encryption provides greater security for distributed jobs, but the processing might take longer.\n* `enable_network_isolation` - (Optional) Whether to allow inbound and outbound network calls to and from the containers used for the monitoring job.\n* `vpc_config` - (Optional) Specifies a VPC that your training jobs and hosted models have access to. Control access to and from your training and model containers by configuring the VPC. Fields are documented below.\n\n#### vpc_config\n\n* `security_group_ids` - (Required) The VPC security group IDs, in the form sg-xxxxxxxx. Specify the security groups for the VPC that is specified in the `subnets` field.\n* `subnets` - (Required) The ID of the subnets in the VPC to which you want to connect your training job or model.\n\n### stopping_condition\n\n* `max_runtime_in_seconds` - (Required) The maximum runtime allowed in seconds.\n\n## Attribute Reference\n\nThis resource exports the following attributes in addition to the arguments above:\n\n* `arn` - The Amazon Resource Name (ARN) assigned by AWS to this data quality job definition.\n* `name` - The name of the data quality job definition.\n* `tags_all` - A map of tags assigned to the resource, including those inherited from the provider [`default_tags` configuration block](https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block).\n\n## Import\n\nIn Terraform v1.5.0 and later, use an [`import` block](https://developer.hashicorp.com/terraform/language/import) to import data quality job definitions using the `name`. For example:\n\n```terraform\nimport {\n  to = aws_sagemaker_data_quality_job_definition.test_data_quality_job_definition\n  id = \"data-quality-job-definition-foo\"\n}\n```\n\nUsing `terraform import`, import data quality job definitions using the `name`. For example:\n\n```console\n% terraform import aws_sagemaker_data_quality_job_definition.test_data_quality_job_definition data-quality-job-definition-foo\n```\n",
      "language": "hcl",
      "path": "website/docs/r/sagemaker_data_quality_job_definition.html.markdown",
      "slug": "sagemaker_data_quality_job_definition",
      "subcategory": "SageMaker",
      "title": "sagemaker_data_quality_job_definition",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3198896"
    }
  }
}