{
  "data": {
    "type": "provider-docs",
    "id": "3224307",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"ACM PCA (Certificate Manager Private Certificate Authority)\"\nlayout: \"aws\"\npage_title: \"AWS: aws_acmpca_certificate_authority\"\ndescription: |-\n  Get information on a AWS Certificate Manager Private Certificate Authority\n---\n\n# Data Source: aws_acmpca_certificate_authority\n\nGet information on a AWS Certificate Manager Private Certificate Authority (ACM PCA Certificate Authority).\n\n## Example Usage\n\n```terraform\ndata \"aws_acmpca_certificate_authority\" \"example\" {\n  arn = \"arn:aws:acm-pca:us-east-1:123456789012:certificate-authority/12345678-1234-1234-1234-123456789012\"\n}\n```\n\n## Argument Reference\n\nThis data source supports the following arguments:\n\n* `arn` - (Required) ARN of the certificate authority.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `id` - ARN of the certificate authority.\n* `certificate` - Base64-encoded certificate authority (CA) certificate. Only available after the certificate authority certificate has been imported.\n* `certificate_chain` - Base64-encoded certificate chain that includes any intermediate certificates and chains up to root on-premises certificate that you used to sign your private CA certificate. The chain does not include your private CA certificate. Only available after the certificate authority certificate has been imported.\n* `certificate_signing_request` - The base64 PEM-encoded certificate signing request (CSR) for your private CA certificate.\n* `usage_mode` - Specifies whether the CA issues general-purpose certificates that typically require a revocation mechanism, or short-lived certificates that may optionally omit revocation because they expire quickly.\n* `not_after` - Date and time after which the certificate authority is not valid. Only available after the certificate authority certificate has been imported.\n* `not_before` - Date and time before which the certificate authority is not valid. Only available after the certificate authority certificate has been imported.\n* `revocation_configuration` - Nested attribute containing revocation configuration.\n    * `revocation_configuration.0.crl_configuration` - Nested attribute containing configuration of the certificate revocation list (CRL), if any, maintained by the certificate authority.\n        * `revocation_configuration.0.crl_configuration.0.custom_cname` - Name inserted into the certificate CRL Distribution Points extension that enables the use of an alias for the CRL distribution point.\n        * `revocation_configuration.0.crl_configuration.0.enabled` - Boolean value that specifies whether certificate revocation lists (CRLs) are enabled.\n        * `revocation_configuration.0.crl_configuration.0.expiration_in_days` - Number of days until a certificate expires.\n        * `revocation_configuration.0.crl_configuration.0.s3_bucket_name` - Name of the S3 bucket that contains the CRL.\n        * `revocation_configuration.0.crl_configuration.0.s3_object_acl` - Whether the CRL is publicly readable or privately held in the CRL Amazon S3 bucket.\n        * `revocation_configuration.0.ocsp_configuration.0.enabled` - Boolean value that specifies whether a custom OCSP responder is enabled.\n        * `revocation_configuration.0.ocsp_configuration.0.ocsp_custom_cname` - A CNAME specifying a customized OCSP domain.\n* `serial` - Serial number of the certificate authority. Only available after the certificate authority certificate has been imported.\n* `status` - Status of the certificate authority.\n* `tags` - Key-value map of user-defined tags that are attached to the certificate authority.\n* `type` - Type of the certificate authority.\n",
      "language": "hcl",
      "path": "website/docs/d/acmpca_certificate_authority.html.markdown",
      "slug": "acmpca_certificate_authority",
      "subcategory": "ACM PCA (Certificate Manager Private Certificate Authority)",
      "title": "acmpca_certificate_authority",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3224307"
    }
  }
}