{
  "data": {
    "type": "provider-docs",
    "id": "3224787",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"VPC IPAM (IP Address Manager)\"\nlayout: \"aws\"\npage_title: \"AWS: aws_vpc_ipam_pool\"\ndescription: |-\n    Returns details about the first IPAM pool that matches search parameters provided.\n---\n\n# Data Source: aws_vpc_ipam_pool\n\n`aws_vpc_ipam_pool` provides details about an IPAM pool.\n\nThis resource can prove useful when an ipam pool was created in another root\nmodule and you need the pool's id as an input variable. For example, pools\ncan be shared via RAM and used to create vpcs with CIDRs from that pool.\n\n## Example Usage\n\nThe following example shows an account that has only 1 pool, perhaps shared\nvia RAM, and using that pool id to create a VPC with a CIDR derived from\nAWS IPAM.\n\n```terraform\ndata \"aws_vpc_ipam_pool\" \"test\" {\n  filter {\n    name   = \"description\"\n    values = [\"*test*\"]\n  }\n\n  filter {\n    name   = \"address-family\"\n    values = [\"ipv4\"]\n  }\n}\n\nresource \"aws_vpc\" \"test\" {\n  ipv4_ipam_pool_id   = data.aws_vpc_ipam_pool.test.id\n  ipv4_netmask_length = 28\n}\n```\n\n## Argument Reference\n\nThe arguments of this data source act as filters for querying the available\nVPCs in the current region. The given filters must match exactly one\nVPC whose data will be exported as attributes.\n\n* `ipam_pool_id` - (Optional) ID of the IPAM pool you would like information on.\n* `filter` - (Optional) Custom filter block as described below.\n\n### filter\n\n* `name` - (Required) The name of the filter. Filter names are case-sensitive.\n* `values` - (Required) The filter values. Filter values are case-sensitive.\n\n## Attribute Reference\n\nAll of the argument attributes except `filter` blocks are also exported as\nresult attributes. This data source will complete the data by populating\nany fields that are not included in the configuration with the data for\nthe selected VPC.\n\nThe following attribute is additionally exported:\n\n* `address_family` - IP protocol assigned to this pool.\n* `allocation_default_netmask_length` - A default netmask length for allocations added to this pool. If, for example, the CIDR assigned to this pool is `10.0.0.0/8` and you enter 16 here, new allocations will default to `10.0.0.0/16`.\n* `allocation_max_netmask_length` - The maximum netmask length that will be required for CIDR allocations in this pool.\n* `allocation_min_netmask_length` - The minimum netmask length that will be required for CIDR allocations in this pool.\n* `allocation_resource_tags` - Tags that are required to create resources in using this pool.\n* `arn` - ARN of the pool\n* `auto_import` - If enabled, IPAM will continuously look for resources within the CIDR range of this pool and automatically import them as allocations into your IPAM.\n* `aws_service` - Limits which service in AWS that the pool can be used in. `ec2` for example, allows users to use space for Elastic IP addresses and VPCs.\n* `description` - Description for the IPAM pool.\n* `id` - ID of the IPAM pool.\n* `ipam_scope_id` - ID of the scope the pool belongs to.\n* `locale` - Locale is the Region where your pool is available for allocations. You can only create pools with locales that match the operating Regions of the IPAM. You can only create VPCs from a pool whose locale matches the VPC's Region.\n* `publicly_advertisable` - Defines whether or not IPv6 pool space is publicly advertisable over the internet.\n* `source_ipam_pool_id` - ID of the source IPAM pool.\n* `tags` - Map of tags to assigned to the resource.\n\n## Timeouts\n\n[Configuration options](https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts):\n\n- `read` - (Default `20m`)\n",
      "language": "hcl",
      "path": "website/docs/d/vpc_ipam_pool.html.markdown",
      "slug": "vpc_ipam_pool",
      "subcategory": "VPC IPAM (IP Address Manager)",
      "title": "vpc_ipam_pool",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3224787"
    }
  }
}