{
  "data": {
    "type": "provider-docs",
    "id": "3224776",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"SSM Incident Manager Incidents\"\nlayout: \"aws\"\npage_title: \"AWS: aws_ssmincidents_response_plan\"\ndescription: |-\n  Terraform data source for managing a response plan in AWS Systems Manager Incident Manager.\n---\n\n# Data Source: aws_ssmincidents_response_plan\n\nUse this Terraform data source to manage a response plan in AWS Systems Manager Incident Manager.\n\n## Example Usage\n\n### Basic Usage\n\n```terraform\nresource \"aws_ssmincidents_response_plan\" \"example\" {\n  arn = \"exampleARN\"\n}\n```\n\n## Argument Reference\n\nThe following arguments are required:\n\n* `arn` - (Required) The Amazon Resource Name (ARN) of the response plan.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `name` - The name of the response plan.\n* `tags` - The tags applied to the response plan.\n* `display_name` - The long format of the response plan name. This field can contain spaces.\n* `chat_channel` - The Chatbot chat channel used for collaboration during an incident.\n* `engagements` - The Amazon Resource Name (ARN) for the contacts and escalation plans that the response plan engages during an incident.\n\nThe `incident_template` configuration block exports the following attributes:\n\n* `title` - The title of a generated incident.\n* `impact` - The impact value of a generated incident. The following values are supported:\n    * `1` - Severe Impact\n    * `2` - High Impact\n    * `3` - Medium Impact\n    * `4` - Low Impact\n    * `5` - No Impact\n* `dedupe_string` - A string used to stop Incident Manager from creating multiple incident records for the same incident.\n* `incident_tags` - The tags assigned to an incident template. When an incident starts, Incident Manager assigns the tags specified in the template to the incident.\n* `summary` - The summary of an incident.\n* `notification_target` - The Amazon Simple Notification Service (Amazon SNS) targets that this incident notifies when it is updated. The `notification_target` configuration block supports the following argument:\n    * `sns_topic_arn` - The ARN of the Amazon SNS topic.\n\nThe `action` configuration block exports the following attributes:\n\n* `action` - (Optional) The actions that the response plan starts at the beginning of an incident.\n    * `ssm_automation` - The Systems Manager automation document to start as the runbook at the beginning of the incident. The following values are supported:\n        * `document_name` - The automation document's name.\n        * `role_arn` - The Amazon Resource Name (ARN) of the role that the automation document assumes when it runs commands.\n        * `document_version` - The version of the automation document to use at runtime.\n        * `target_account` - The account that runs the automation document. This can be in either the management account or an application account.\n        * `parameter` - The key-value pair parameters used when the automation document runs. The following values are supported:\n            * `name` - The name of parameter.\n            * `values` - The values for the associated parameter name.\n        * `dynamic_parameters` - The key-value pair used to resolve dynamic parameter values when processing a Systems Manager Automation runbook.\n\nThe `integration` configuration block exports the following attributes:\n\n* `integration` - Information about third-party services integrated into the response plan. The following values are supported:\n    * `pagerduty` - Details about the PagerDuty configuration for a response plan. The following values are supported:\n        * `name` - The name of the PagerDuty configuration.\n        * `service_id` - The ID of the PagerDuty service that the response plan associates with an incident when it launches.\n        * `secret_id` - The ID of the AWS Secrets Manager secret that stores your PagerDuty key &mdash; either a General Access REST API Key or User Token REST API Key &mdash; and other user credentials.\n",
      "language": "hcl",
      "path": "website/docs/d/ssmincidents_response_plan.html.markdown",
      "slug": "ssmincidents_response_plan",
      "subcategory": "SSM Incident Manager Incidents",
      "title": "ssmincidents_response_plan",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3224776"
    }
  }
}