{
  "data": {
    "type": "provider-docs",
    "id": "3224728",
    "attributes": {
      "category": "data-sources",
      "content": "---\nsubcategory: \"S3 Control\"\nlayout: \"aws\"\npage_title: \"AWS: aws_s3control_multi_region_access_point\"\ndescription: |-\n  Provides details an S3 Multi-Region Access Point.\n---\n\n# Data Source: aws_s3control_multi_region_access_point\n\nProvides details on a specific S3 Multi-Region Access Point.\n\n## Example Usage\n\n```terraform\ndata \"aws_s3control_multi_region_access_point\" \"example\" {\n  name = \"example\"\n}\n```\n\n## Argument Reference\n\nThis data source supports the following arguments:\n\n* `account_id` - (Optional) The AWS account ID of the S3 Multi-Region Access Point. Defaults to automatically determined account ID of the Terraform AWS provider.\n* `name` - (Required) The name of the Multi-Region Access Point.\n\n## Attribute Reference\n\nThis data source exports the following attributes in addition to the arguments above:\n\n* `alias` - The alias for the Multi-Region Access Point.\n* `arn` - Amazon Resource Name (ARN) of the Multi-Region Access Point.\n* `created_at` - Timestamp when the resource has been created.\n* `domain_name` - The DNS domain name of the S3 Multi-Region Access Point in the format _`alias`_.accesspoint.s3-global.amazonaws.com. For more information, see the documentation on [Multi-Region Access Point Requests](https://docs.aws.amazon.com/AmazonS3/latest/userguide/MultiRegionAccessPointRequests.html).\n* `public_access_block` - Public Access Block of the Multi-Region Access Point. Detailed below.\n* `regions` - A collection of the regions and buckets associated with the Multi-Region Access Point.\n* `status` - The current status of the Multi-Region Access Point.\n\n### public_access_block\n\n* `block_public_acls` - Specifies whether Amazon S3 should block public access control lists (ACLs). When set to `true` causes the following behavior:\n    * PUT Bucket acl and PUT Object acl calls fail if the specified ACL is public.\n    * PUT Object calls fail if the request includes a public ACL.\n    * PUT Bucket calls fail if the request includes a public ACL.\n* `block_public_policy` - Specifies whether Amazon S3 should block public bucket policies for buckets in this account. When set to `true` causes Amazon S3 to:\n    * Reject calls to PUT Bucket policy if the specified bucket policy allows public access.\n* `ignore_public_acls` - Specifies whether Amazon S3 should ignore public ACLs for buckets in this account. When set to `true` causes Amazon S3 to:\n    * Ignore all public ACLs on buckets in this account and any objects that they contain.\n* `restrict_public_buckets` - Specifies whether Amazon S3 should restrict public bucket policies for buckets in this account. When set to `true`:\n    * Only the bucket owner and AWS Services can access buckets with public policies.\n\n### regions\n\n* `bucket` - The name of the bucket.\n* `bucket_account_id` - The AWS account ID that owns the bucket.\n* `region` - The name of the region.\n",
      "language": "hcl",
      "path": "website/docs/d/s3control_multi_region_access_point.html.markdown",
      "slug": "s3control_multi_region_access_point",
      "subcategory": "S3 Control",
      "title": "s3control_multi_region_access_point",
      "truncated": false
    },
    "links": {
      "self": "/v2/provider-docs/3224728"
    }
  }
}